<unk>	0
<s>	0
</s>	0
s	-2.89436
▁	-2.97658
▁.	-3.29507
,	-3.48857
▁the	-3.57435
▁a	-3.84188
▁and	-3.984
▁of	-3.98667
▁'	-4.2064
-	-4.24636
▁to	-4.32973
ly	-4.33884
t	-4.4269
▁is	-4.54322
ing	-4.55956
y	-4.57823
▁it	-4.78841
▁in	-4.79566
ed	-4.86121
e	-5.08052
▁The	-5.09913
▁film	-5.19305
▁with	-5.28346
▁movie	-5.33721
▁A	-5.35121
▁but	-5.36807
▁tha	-5.38086
▁as	-5.42377
▁be	-5.44902
▁for	-5.45462
'	-5.46228
d	-5.46449
▁th	-5.54773
▁an	-5.56737
▁its	-5.59065
▁you	-5.71335
at	-5.7669
▁It	-5.79586
▁I	-5.80224
▁n	-5.83467
▁on	-5.90832
▁not	-5.9231
..	-5.95162
es	-6.01563
▁by	-6.05855
▁are	-6.11174
▁-	-6.13536
▁more	-6.14549
▁like	-6.15011
▁has	-6.17357
▁thi	-6.18983
▁one	-6.19672
▁from	-6.21669
▁than	-6.22996
▁`	-6.24397
about	-6.28297
▁all	-6.30253
▁his	-6.30833
have	-6.32002
er	-6.34551
n	-6.35984
▁so	-6.37114
is	-6.37419
▁at	-6.43586
▁who	-6.44651
re	-6.44998
▁make	-6.45562
▁or	-6.49335
▁t	-6.51184
▁story	-6.52067
▁character	-6.52823
▁no	-6.59897
▁up	-6.64079
▁too	-6.64717
▁out	-6.65056
▁time	-6.65341
▁most	-6.65826
▁into	-6.67464
▁just	-6.71405
on	-6.72019
al	-6.7426
▁good	-6.74267
ity	-6.75439
▁some	-6.75599
▁do	-6.77729
▁will	-6.7812
▁can	-6.78516
▁comedy	-6.78704
▁much	-6.79958
ness	-6.80733
`	-6.84578
▁un	-6.85059
.	-6.85505
▁any	-6.86385
ir	-6.86665
f	-6.87074
▁real	-6.87426
a	-6.87798
▁what	-6.8784
▁doe	-6.89384
▁way	-6.89824
able	-6.90088
if	-6.9086
▁An	-6.91085
▁Thi	-6.91518
▁performance	-6.92708
▁even	-6.93589
hat	-6.96198
▁well	-6.96426
▁see	-6.96983
▁get	-6.97921
le	-6.9798
ce	-6.98556
▁only	-6.99962
▁look	-7.02302
▁little	-7.0247
▁he	-7.0454
ch	-7.04748
▁en	-7.05113
out	-7.05309
▁funny	-7.06475
▁go	-7.07454
▁man	-7.08107
ve	-7.08538
▁work	-7.08588
ough	-7.09414
r	-7.09726
▁may	-7.10132
▁whi	-7.10382
▁us	-7.10919
▁feel	-7.11234
▁been	-7.12518
▁over	-7.12604
▁your	-7.12736
▁never	-7.16713
▁life	-7.16821
very	-7.17449
m	-7.18869
▁love	-7.19159
▁would	-7.20424
▁was	-7.2056
▁every	-7.21341
▁there	-7.21579
one	-7.22475
▁we	-7.23122
▁director	-7.23267
en	-7.24242
?	-7.25716
o	-7.26415
▁bad	-7.26559
▁through	-7.27405
▁best	-7.27921
▁al	-7.27947
ry	-7.27955
ies	-7.28359
▁when	-7.28376
▁seem	-7.30185
▁watch	-7.30774
▁could	-7.31517
:	-7.31908
▁other	-7.34088
▁take	-7.34904
▁plot	-7.35634
ion	-7.3615
way	-7.36919
se	-7.37035
▁come	-7.37293
▁long	-7.37312
less	-7.39139
▁C	-7.40094
▁drama	-7.41138
▁should	-7.41907
▁her	-7.41991
▁how	-7.421
▁off	-7.4255
▁made	-7.42565
▁S	-7.42805
thing	-7.42941
▁them	-7.44977
▁action	-7.45373
▁something	-7.46476
▁audience	-7.47386
▁cast	-7.47538
self	-7.47774
▁own	-7.48375
▁still	-7.49714
in	-7.50497
age	-7.50967
▁thing	-7.51026
▁wh	-7.51065
st	-7.51314
▁people	-7.5207
▁two	-7.52209
an	-7.53586
▁great	-7.54585
▁T	-7.5468
▁give	-7.55354
▁What	-7.56534
▁hard	-7.57694
▁fun	-7.57967
other	-7.58593
▁better	-7.58936
▁ca	-7.59142
▁d	-7.59271
▁first	-7.59627
▁down	-7.59905
▁year	-7.60019
▁new	-7.60526
▁kind	-7.62378
▁B	-7.62489
▁picture	-7.62841
▁moment	-7.62964
▁heart	-7.64088
ation	-7.64911
▁actor	-7.65198
▁might	-7.66253
ll	-7.66385
▁ever	-7.66563
ally	-7.67125
▁end	-7.67215
▁laugh	-7.67524
▁far	-7.67539
▁script	-7.67654
▁humor	-7.67676
ful	-7.67789
▁show	-7.69019
▁sense	-7.69155
▁lack	-7.69201
▁scene	-7.70451
th	-7.70721
tween	-7.70794
▁both	-7.71521
▁In	-7.71895
lso	-7.72171
▁big	-7.72192
those	-7.72363
▁But	-7.72367
▁worth	-7.72446
ic	-7.72616
▁You	-7.72806
▁few	-7.73439
▁want	-7.74499
ment	-7.74538
▁being	-7.74647
▁play	-7.74723
i	-7.76277
▁here	-7.76369
cause	-7.76812
ther	-7.76853
▁thriller	-7.77628
;	-7.78663
most	-7.7881
▁tale	-7.79005
l	-7.79086
▁old	-7.79136
▁D	-7.79604
▁self	-7.79936
h	-7.80732
man	-7.80733
▁lot	-7.81466
▁often	-7.82782
▁documentary	-7.82841
▁original	-7.83033
▁need	-7.83215
▁s	-7.83308
▁keep	-7.84443
▁find	-7.8465
▁world	-7.8465
▁know	-7.86396
▁No	-7.8657
▁American	-7.86737
ous	-7.87397
▁less	-7.87857
▁Hollywood	-7.87883
▁entertaining	-7.87979
▁screen	-7.88144
ng	-7.88894
▁emotional	-7.89627
▁E	-7.89798
▁full	-7.9068
▁One	-7.90709
▁M	-7.91296
▁turn	-7.91752
▁re	-7.91896
▁!	-7.92114
▁again	-7.92224
▁romantic	-7.92311
▁point	-7.92571
▁interesting	-7.92901
▁ultimate	-7.93064
▁filmmaker	-7.93431
▁back	-7.93901
quite	-7.9422
▁P	-7.94295
▁were	-7.94302
the	-7.94339
▁human	-7.94377
ers	-7.94888
of	-7.94936
▁him	-7.94966
▁think	-7.95145
his	-7.96534
▁me	-7.96626
▁visual	-7.96733
▁ye	-7.96805
▁part	-7.97307
▁family	-7.97836
▁For	-7.98027
fore	-7.99155
▁Not	-7.99414
▁wo	-7.99953
▁become	-8.0114
▁acting	-8.01358
▁after	-8.01615
▁same	-8.02572
▁deliver	-8.02603
▁live	-8.03009
tic	-8.03323
▁where	-8.03437
ty	-8.03778
uch	-8.03886
▁piece	-8.03941
▁right	-8.04729
▁De	-8.04885
hing	-8.04924
▁star	-8.05167
\/	-8.05489
▁bit	-8.05843
▁subject	-8.06606
or	-8.06657
▁say	-8.06751
▁high	-8.07458
▁idea	-8.08962
▁under	-8.09304
▁Like	-8.09765
▁enjoy	-8.10046
▁As	-8.10092
▁material	-8.1084
▁With	-8.1103
▁compelling	-8.12119
▁deep	-8.12884
▁experience	-8.1377
▁my	-8.13914
▁flick	-8.14602
minutes	-8.14856
▁child	-8.14904
ialogue	-8.15172
▁young	-8.15213
▁fan	-8.15687
to	-8.16128
▁our	-8.1629
▁beautiful	-8.16397
bout	-8.16671
and	-8.17559
son	-8.1769
time	-8.18533
▁direct	-8.18733
▁F	-8.19238
▁half	-8.19298
▁w	-8.20014
est	-8.2017
ither	-8.20684
▁dark	-8.21469
▁offer	-8.22269
▁dull	-8.22491
▁All	-8.22892
▁clever	-8.23498
▁music	-8.23523
c	-8.23527
▁charm	-8.23656
▁Th	-8.23769
▁special	-8.24033
▁mind	-8.24176
▁problem	-8.2473
espite	-8.24828
▁set	-8.24872
▁leave	-8.24989
▁whole	-8.25058
▁surprising	-8.25198
▁place	-8.25225
▁entertainment	-8.25998
ism	-8.26132
▁viewer	-8.27697
▁hour	-8.2772
▁did	-8.28088
▁e	-8.28106
▁H	-8.28509
▁title	-8.28638
▁W	-8.28764
▁cinematic	-8.28767
▁perfect	-8.29073
▁video	-8.29209
ever	-8.29338
▁though	-8.29771
▁cinema	-8.29803
▁art	-8.30014
▁fascinat	-8.30201
▁talent	-8.30451
▁comic	-8.30467
▁feature	-8.3055
▁actual	-8.30785
ich	-8.31452
▁once	-8.32184
▁manage	-8.32235
▁care	-8.32329
▁near	-8.32364
▁matter	-8.32492
▁Be	-8.32657
▁last	-8.32719
▁low	-8.34231
▁fail	-8.34391
▁style	-8.34411
▁put	-8.3479
▁wit	-8.34879
▁p	-8.34881
up	-8.35195
▁pretty	-8.35201
▁direction	-8.35265
imes	-8.35389
▁kids	-8.35433
▁light	-8.35738
old	-8.35903
▁rare	-8.3601
▁sweet	-8.36618
▁short	-8.36651
day	-8.36801
▁together	-8.37326
▁interest	-8.37459
▁effort	-8.37937
▁since	-8.37977
▁certain	-8.38005
ting	-8.38117
▁Even	-8.38145
▁genre	-8.38177
▁making	-8.38196
▁Mr	-8.38275
▁final	-8.38381
▁i	-8.38414
▁serious	-8.38502
▁moving	-8.38897
had	-8.38968
▁predictabl	-8.39317
▁ra	-8.39334
▁Al	-8.39574
▁leas	-8.39834
▁Whi	-8.40343
▁works	-8.40361
it	-8.41139
▁lead	-8.41417
▁So	-8.41586
ish	-8.41619
ten	-8.4193
▁Though	-8.42013
▁power	-8.42946
ren	-8.43013
▁she	-8.43254
▁R	-8.4348
▁co	-8.43889
▁level	-8.4391
▁cliche	-8.43925
▁strong	-8.4425
ive	-8.44509
▁true	-8.44697
▁tell	-8.44702
▁fine	-8.44702
ard	-8.44737
▁dis	-8.44786
▁complete	-8.44842
▁wors	-8.45056
▁start	-8.45078
w	-8.45143
▁obvious	-8.45345
all	-8.45405
▁sound	-8.45588
▁smart	-8.45752
ey	-8.46019
▁ha	-8.46278
▁N	-8.46281
▁New	-8.46729
▁eye	-8.46904
▁silly	-8.47065
▁face	-8.4752
▁energ	-8.47635
▁b	-8.47975
▁To	-8.48084
▁done	-8.48134
us	-8.48289
▁premise	-8.48444
▁attempt	-8.48465
▁entire	-8.48487
▁message	-8.48505
▁three	-8.48766
▁slow	-8.48858
▁hav	-8.4936
ary	-8.49528
▁sad	-8.49692
▁formula	-8.50124
▁day	-8.50161
▁engaging	-8.50285
▁coming	-8.50441
▁theater	-8.50654
▁quirk	-8.5089
▁image	-8.51237
▁writer	-8.51446
▁screenplay	-8.51652
▁narrative	-8.51748
▁horror	-8.52028
around	-8.52282
▁head	-8.52546
▁mess	-8.53183
▁fresh	-8.5323
▁feeling	-8.53456
▁close	-8.53671
▁twist	-8.54316
▁war	-8.5432
▁Do	-8.54563
▁seri	-8.54723
▁honest	-8.54962
▁de	-8.5501
▁sure	-8.55123
▁O	-8.55317
▁bring	-8.55484
▁La	-8.55595
▁fall	-8.55904
▁familiar	-8.55947
though	-8.55989
▁L	-8.56145
▁romance	-8.56641
▁happen	-8.56659
▁John	-8.56834
as	-8.56934
▁solid	-8.56981
▁trying	-8.57012
▁else	-8.5706
▁classic	-8.57102
▁thought	-8.5742
▁surprise	-8.57631
▁simpl	-8.5782
p	-8.5787
▁shot	-8.5819
cy	-8.58597
▁dramatic	-8.58645
▁past	-8.5871
ything	-8.58743
▁suspense	-8.58835
▁must	-8.58871
▁hit	-8.58881
▁Un	-8.59022
▁And	-8.59389
▁odd	-8.59648
▁enjoyabl	-8.5965
ble	-8.60159
▁amusing	-8.60344
▁sort	-8.60403
▁version	-8.60416
▁stand	-8.60854
▁prove	-8.60894
▁He	-8.61346
istic	-8.61617
▁stud	-8.61697
▁culture	-8.6178
▁create	-8.61831
▁particular	-8.61907
▁along	-8.62567
▁clear	-8.62595
▁run	-8.62626
▁histor	-8.62695
ine	-8.63018
special	-8.63416
▁remain	-8.63809
▁small	-8.63839
▁bor	-8.63931
ted	-8.64025
▁reason	-8.64176
▁intelligent	-8.64295
▁pleasure	-8.64382
ile	-8.64658
▁Some	-8.64711
▁rich	-8.64859
be	-8.65487
▁debut	-8.65581
▁flaw	-8.65602
▁treat	-8.65909
▁role	-8.66
▁modern	-8.66129
▁stuff	-8.663
k	-8.66524
▁charming	-8.66759
▁line	-8.66884
▁sex	-8.67214
▁exercise	-8.67459
▁portrait	-8.6746
▁act	-8.68321
▁book	-8.68738
ne	-8.68965
▁call	-8.69012
▁slight	-8.69511
▁We	-8.69858
um	-8.69947
u	-8.70249
▁word	-8.70438
hile	-8.70748
▁Every	-8.70854
each	-8.70941
director	-8.711
▁result	-8.71339
▁Just	-8.7137
▁fact	-8.71412
▁sequel	-8.7146
▁dumb	-8.71581
▁tone	-8.71633
▁production	-8.71727
▁easy	-8.71795
▁gag	-8.71912
▁now	-8.7221
▁help	-8.72332
▁believe	-8.72565
▁teen	-8.72742
▁somet	-8.72901
▁Li	-8.73089
▁warm	-8.73208
▁opera	-8.73316
▁question	-8.73457
▁powerful	-8.7351
▁hero	-8.7408
▁ending	-8.74406
▁effect	-8.74645
▁recent	-8.75397
▁When	-8.75666
▁miss	-8.76624
▁moral	-8.76718
▁m	-8.76855
▁strange	-8.77426
minute	-8.77467
▁add	-8.77501
▁relationship	-8.77588
▁project	-8.77589
ory	-8.77642
ie	-8.77686
▁follow	-8.77805
▁c	-8.77839
▁open	-8.77885
▁pop	-8.77951
▁r	-8.78608
▁spirit	-8.78673
like	-8.79466
▁genuine	-8.79589
▁Director	-8.79596
▁quiet	-8.79604
▁element	-8.79609
▁wonder	-8.79703
▁French	-8.79713
▁force	-8.79813
▁easi	-8.79993
▁adult	-8.80108
▁tru	-8.80296
ter	-8.80341
▁jokes	-8.80493
▁Davi	-8.80608
▁On	-8.81521
▁melodrama	-8.81739
▁detail	-8.81889
▁summer	-8.81936
▁usual	-8.82022
▁possibl	-8.82048
▁flat	-8.82155
▁reality	-8.82403
▁use	-8.82601
▁heavy	-8.82653
▁K	-8.82908
▁ride	-8.83077
▁Le	-8.83129
▁TV	-8.8331
▁let	-8.83901
▁left	-8.8396
▁straight	-8.83988
▁sequence	-8.84042
▁reveal	-8.84165
▁hand	-8.84503
▁mood	-8.84573
▁touching	-8.84633
▁That	-8.84929
il	-8.84995
id	-8.85002
off	-8.85399
▁At	-8.8549
▁Too	-8.85777
▁minute	-8.86217
▁quick	-8.86256
▁difficult	-8.86257
▁intriguing	-8.86292
▁understand	-8.86294
▁Jack	-8.86326
▁beyond	-8.8639
▁brilliant	-8.86425
▁crime	-8.86454
iness	-8.86573
ves	-8.86592
▁second	-8.86809
▁late	-8.86951
▁My	-8.87086
▁simple	-8.87101
▁adventure	-8.87115
▁satisfying	-8.87116
ney	-8.8737
▁By	-8.87462
▁fair	-8.88041
next	-8.88191
▁emotion	-8.8841
ical	-8.88587
▁wonderful	-8.88624
by	-8.88638
▁terrific	-8.88645
▁large	-8.88817
▁super	-8.88916
▁artist	-8.88991
▁f	-8.89026
▁found	-8.89253
▁remarkabl	-8.89257
▁nice	-8.89297
ily	-8.89821
ar	-8.89875
▁main	-8.90057
▁journ	-8.90249
fi	-8.90387
▁passion	-8.91028
▁psychological	-8.91117
▁above	-8.91136
▁truth	-8.91173
▁present	-8.91302
year	-8.91365
▁camera	-8.91388
▁capture	-8.91492
▁ma	-8.91516
▁tries	-8.91627
▁deal	-8.91806
▁Love	-8.91981
▁sentimental	-8.92518
▁hope	-8.92902
▁deserve	-8.93039
▁approach	-8.93069
▁mix	-8.93079
ro	-8.93369
▁situation	-8.93402
▁insight	-8.93454
▁refreshing	-8.93463
▁occasional	-8.93564
ling	-8.93756
▁extreme	-8.93884
▁pretentious	-8.93952
▁abou	-8.94061
effects	-8.94456
▁War	-8.94592
ian	-8.95182
▁grow	-8.95894
▁cartoon	-8.95899
▁painful	-8.95912
▁social	-8.95914
▁Disney	-8.96041
▁exact	-8.96043
2	-8.96051
▁black	-8.96057
▁epic	-8.96118
so	-8.96154
▁impossibl	-8.96198
▁Man	-8.9654
▁Re	-8.96703
▁political	-8.96708
▁dead	-8.9673
▁nor	-8.97014
▁home	-8.9745
▁expect	-8.97748
where	-8.97783
▁provide	-8.97839
▁complex	-8.97913
▁Ca	-8.97957
▁soul	-8.98565
different	-8.98567
▁sustain	-8.98611
▁effective	-8.98632
▁Time	-8.98845
▁Good	-8.99004
▁writing	-8.99303
ese	-8.99724
▁G	-8.99762
▁stor	-9.00166
▁inter	-9.00316
▁wild	-9.0069
▁memor	-9.00693
▁weird	-9.01091
▁animation	-9.01102
▁pro	-9.01102
▁middle	-9.01119
wise	-9.01176
▁hilarious	-9.0125
▁Big	-9.01267
▁mild	-9.01369
▁standard	-9.01421
ather	-9.01605
▁pull	-9.01614
▁How	-9.0176
▁taste	-9.01929
movie	-9.01959
▁fill	-9.02249
▁case	-9.02357
ant	-9.02816
▁appear	-9.02866
probabl	-9.02944
▁game	-9.03083
▁Brit	-9.03108
▁mere	-9.0311
▁Ben	-9.03485
▁mean	-9.03505
budget	-9.03757
▁already	-9.03791
▁delightful	-9.03821
▁thoughtful	-9.03878
▁traged	-9.0388
▁qualit	-9.03884
ael	-9.03952
▁satir	-9.03952
▁death	-9.03973
▁utter	-9.04464
ure	-9.04471
te	-9.04761
▁J	-9.04909
▁consider	-9.04992
▁personal	-9.05121
▁form	-9.05277
▁pace	-9.05294
▁X	-9.05306
own	-9.05328
▁fast	-9.05704
A	-9.05707
▁appeal	-9.05792
▁event	-9.05817
▁change	-9.05843
ance	-9.05897
making	-9.06549
▁Robert	-9.06569
▁process	-9.06576
▁tedious	-9.06578
▁sit	-9.06619
▁soap	-9.06623
▁begin	-9.06627
z	-9.06699
▁Ma	-9.06746
job	-9.06763
▁boy	-9.06852
▁depth	-9.0689
▁parent	-9.07021
▁suffer	-9.07135
ated	-9.07415
▁novel	-9.07434
▁Ja	-9.0753
▁pure	-9.07624
▁Has	-9.08115
▁hold	-9.08214
▁cut	-9.08221
side	-9.09081
▁storytell	-9.09155
stead	-9.0922
▁air	-9.09249
▁potential	-9.09429
▁impressive	-9.09442
▁waste	-9.09484
▁awful	-9.09593
▁grand	-9.09622
▁bland	-9.09639
▁mystery	-9.0976
▁sexual	-9.09795
wrong	-9.09798
▁pay	-9.09906
▁issue	-9.09931
el	-9.09953
hood	-9.10172
▁credit	-9.10189
▁school	-9.10437
funny	-9.1048
ought	-9.10655
▁touch	-9.10674
▁wom	-9.1107
▁God	-9.11329
▁value	-9.11408
▁subtle	-9.1144
▁violen	-9.11584
▁general	-9.11662
▁intelligen	-9.11804
years	-9.1219
▁pe	-9.12377
▁se	-9.12405
mer	-9.12456
▁Mich	-9.1246
▁Oscar	-9.12526
▁monster	-9.12551
▁single	-9.12559
▁name	-9.12667
▁vision	-9.12782
g	-9.12876
rs	-9.12885
men	-9.13015
ence	-9.13186
▁sci	-9.1319
▁allow	-9.13263
▁magic	-9.13435
cross	-9.1345
handed	-9.13491
ose	-9.13703
▁equal	-9.14162
▁writ	-9.14587
cted	-9.14642
x	-9.14768
▁Ther	-9.14785
▁filmmak	-9.15044
▁mark	-9.1509
▁gentl	-9.1515
▁thorough	-9.15422
▁attention	-9.15576
▁post	-9.156
▁concept	-9.1583
▁men	-9.15923
▁gone	-9.16416
▁got	-9.16835
▁rest	-9.17127
▁drag	-9.17158
▁count	-9.17436
ck	-9.17489
▁car	-9.17617
▁sharp	-9.17876
▁More	-9.17916
▁side	-9.17935
▁period	-9.18513
▁engross	-9.18518
▁excellen	-9.18539
▁contriv	-9.18556
▁recommend	-9.18654
▁adaptation	-9.1876
▁animated	-9.18806
▁brain	-9.18923
▁bare	-9.18952
▁cool	-9.19242
▁view	-9.19247
▁U	-9.19251
▁terribl	-9.1929
nstead	-9.19341
▁non	-9.19821
for	-9.19851
▁II	-9.20163
▁faith	-9.20247
▁stay	-9.20577
▁craft	-9.20789
▁class	-9.20917
ist	-9.20996
▁fight	-9.21041
▁cheap	-9.21543
▁focus	-9.21579
▁ne	-9.21604
▁success	-9.21726
▁conflict	-9.21741
▁mediocr	-9.21742
▁gorgeous	-9.21745
▁Co	-9.21751
▁succeed	-9.21752
▁remake	-9.21766
▁Full	-9.21767
▁actress	-9.21859
▁historical	-9.21896
▁William	-9.21928
▁pre	-9.22061
▁manner	-9.22168
▁sub	-9.22217
▁Na	-9.22355
▁career	-9.22396
screen	-9.22688
▁wait	-9.22744
▁20	-9.22982
▁examin	-9.23066
▁stupid	-9.232
▁Sea	-9.23312
ur	-9.23897
▁thrill	-9.24231
▁nature	-9.24458
ward	-9.24983
▁earnest	-9.25106
▁ugly	-9.25156
▁tension	-9.25182
▁Most	-9.25191
▁term	-9.25274
▁creepy	-9.25293
▁ambitious	-9.25306
▁Well	-9.25334
▁decent	-9.25387
▁fantasy	-9.25392
▁future	-9.2542
ts	-9.25443
▁pac	-9.25486
▁four	-9.25509
▁girl	-9.2592
▁important	-9.2601
▁excit	-9.2632
▁appealing	-9.26413
▁doing	-9.26525
▁serve	-9.26735
msel	-9.26853
lly	-9.27163
▁dur	-9.27173
▁natural	-9.27185
sh	-9.27187
▁com	-9.27374
▁Ne	-9.27484
▁Mar	-9.27509
▁Ba	-9.27889
▁Lo	-9.2802
▁10	-9.28033
▁con	-9.28201
▁break	-9.28248
ring	-9.28301
▁vivid	-9.28516
▁routine	-9.28518
▁plain	-9.28633
▁Car	-9.2864
▁cold	-9.28713
itting	-9.28814
▁plent	-9.28821
D	-9.28968
▁scary	-9.29001
omen	-9.29012
▁inside	-9.29016
▁creative	-9.29251
▁memory	-9.29532
▁joy	-9.29664
▁runn	-9.29718
▁throw	-9.29767
▁blood	-9.30299
me	-9.30418
nt	-9.3047
▁v	-9.30513
▁free	-9.30648
▁guy	-9.30925
ver	-9.3143
he	-9.31502
▁America	-9.31679
▁su	-9.31782
▁meaning	-9.3193
▁Gran	-9.3199
▁female	-9.32086
▁After	-9.32089
▁welcome	-9.3209
▁impact	-9.32091
▁thin	-9.32112
▁unexpected	-9.32139
▁major	-9.32175
▁among	-9.32196
▁Bo	-9.3231
▁imagine	-9.32318
▁amount	-9.32319
▁damn	-9.32325
land	-9.3242
key	-9.32424
R	-9.32453
▁promise	-9.32541
▁score	-9.32687
nce	-9.32815
▁episode	-9.3299
▁song	-9.33018
ny	-9.33243
▁Fro	-9.33615
life	-9.33747
semble	-9.33944
▁2	-9.33967
▁Steven	-9.34064
red	-9.34071
▁Ho	-9.34319
ley	-9.34502
▁Ye	-9.34533
S	-9.34648
▁Men	-9.3465
▁share	-9.34804
▁lo	-9.3486
beat	-9.34954
▁edge	-9.35025
▁Girl	-9.35762
▁design	-9.35789
▁previous	-9.35792
▁predecessor	-9.35794
▁friendship	-9.35795
▁Movie	-9.35822
▁absolute	-9.35839
▁successful	-9.35855
▁Watch	-9.35881
▁inventive	-9.35975
▁couple	-9.35997
▁remember	-9.3606
▁blend	-9.36108
▁drive	-9.36142
▁speak	-9.36487
▁tear	-9.36695
▁ill	-9.36709
▁avoid	-9.36843
▁di	-9.36861
ma	-9.36974
▁Day	-9.37143
▁move	-9.37231
▁wish	-9.37309
▁release	-9.37394
ke	-9.37425
▁definite	-9.37633
how	-9.38675
▁fit	-9.38706
▁simp	-9.39225
▁los	-9.39255
▁comedi	-9.39437
▁delight	-9.39585
▁Secret	-9.39601
▁chemist	-9.39601
▁unique	-9.39607
▁behind	-9.39625
▁superficial	-9.39638
▁provocative	-9.39643
▁bitter	-9.39675
▁flash	-9.39686
▁unsettling	-9.39687
▁sign	-9.39718
▁figure	-9.39731
▁doubt	-9.39736
▁huge	-9.39803
▁deft	-9.39822
▁Spielberg	-9.39853
▁thank	-9.39902
▁working	-9.39904
▁fel	-9.39959
pping	-9.40002
▁root	-9.40008
▁stunt	-9.40149
▁sincere	-9.40303
▁joke	-9.40346
▁cute	-9.40401
fashioned	-9.40415
▁unlike	-9.40442
▁colleg	-9.40451
▁none	-9.405
▁dream	-9.40828
▁mother	-9.4085
▁edit	-9.41056
▁goof	-9.41194
▁water	-9.41235
ton	-9.41356
▁h	-9.41525
▁Boy	-9.41942
▁hip	-9.41986
▁necessar	-9.4224
ize	-9.42285
▁talk	-9.42401
▁imaginati	-9.42494
dy	-9.42515
▁br	-9.4254
▁l	-9.42843
▁number	-9.43147
▁date	-9.43595
▁delicate	-9.43602
▁unusual	-9.43603
▁crowd	-9.43604
▁Japan	-9.43605
▁awkward	-9.43656
▁abilit	-9.43676
▁supposed	-9.43676
▁kid	-9.43697
▁pleasant	-9.43705
▁Feel	-9.43705
▁construct	-9.43773
hearted	-9.43791
▁charisma	-9.43805
ned	-9.43812
▁Bond	-9.43859
▁meditati	-9.43889
▁Kid	-9.43913
▁Home	-9.43945
ball	-9.44021
▁Spy	-9.44058
▁reward	-9.44075
▁contemporar	-9.44106
right	-9.44142
over	-9.44286
uous	-9.44301
▁concern	-9.4434
b	-9.44454
▁Chin	-9.44483
B	-9.44524
▁wear	-9.44636
▁balance	-9.44656
▁roll	-9.44785
M	-9.44845
▁frame	-9.4499
▁funnie	-9.45171
▁pass	-9.45176
▁convincing	-9.45382
ial	-9.45407
▁road	-9.45683
▁Park	-9.45693
▁ago	-9.45809
led	-9.45856
than	-9.45868
▁Go	-9.46321
sky	-9.46341
school	-9.46346
▁foot	-9.4653
▁cultur	-9.46537
▁cross	-9.47047
▁person	-9.4716
▁weak	-9.47189
em	-9.47282
▁stage	-9.47326
ock	-9.47385
▁reach	-9.47435
▁combin	-9.47621
▁Georg	-9.47757
▁cynic	-9.47772
▁stylish	-9.47778
▁triumph	-9.47783
▁substance	-9.47795
▁stunning	-9.47803
▁melodramatic	-9.47817
▁uneven	-9.47819
▁disturbing	-9.47926
▁win	-9.47959
▁Green	-9.47976
▁murder	-9.48022
ight	-9.48193
▁grace	-9.4824
▁Wh	-9.48241
▁g	-9.48285
▁inspir	-9.48404
saw	-9.48455
▁fran	-9.48519
▁absorb	-9.48552
▁setting	-9.48606
▁Ver	-9.48634
provok	-9.48693
▁dog	-9.48695
given	-9.48712
▁urban	-9.48744
▁beaut	-9.4877
▁ground	-9.48804
▁respect	-9.48832
▁desperate	-9.48865
▁Her	-9.49022
▁opportunit	-9.49069
▁winning	-9.49089
▁suggest	-9.49154
probab	-9.49187
▁remind	-9.49803
▁Tom	-9.49831
▁motion	-9.49889
ul	-9.49917
co	-9.4997
▁loud	-9.5003
▁somewh	-9.50079
▁gross	-9.5023
taking	-9.50512
head	-9.50565
▁Wild	-9.50747
ible	-9.50769
▁York	-9.50923
▁Thing	-9.51029
▁High	-9.51171
line	-9.51236
▁haunt	-9.51521
act	-9.51562
▁save	-9.51936
▁highly	-9.52099
▁rhythm	-9.52115
▁eventual	-9.52122
▁gift	-9.52126
▁drug	-9.52131
▁Two	-9.52152
▁intimate	-9.52201
▁battle	-9.52201
▁Adam	-9.52224
▁learn	-9.52227
▁tragic	-9.52297
hour	-9.52373
▁Show	-9.52395
▁shock	-9.52416
ot	-9.52508
▁sever	-9.52524
▁sensitiv	-9.52632
▁masterpiece	-9.52658
▁inspire	-9.52687
mes	-9.52853
▁trip	-9.52909
▁camp	-9.53009
een	-9.53115
▁pack	-9.53219
▁rivet	-9.53318
▁involving	-9.53377
▁Is	-9.53417
▁forgettabl	-9.53421
▁fear	-9.53532
▁skin	-9.5359
▁match	-9.53619
▁emerge	-9.53631
▁toward	-9.53769
▁based	-9.53811
mon	-9.54012
ld	-9.54046
▁poignan	-9.54091
▁Z	-9.54336
some	-9.54402
▁hack	-9.54511
▁try	-9.54587
▁top	-9.54642
▁era	-9.54714
om	-9.54732
▁gri	-9.54911
▁costume	-9.54941
▁19	-9.55041
body	-9.55079
low	-9.55094
etic	-9.55168
made	-9.55255
ski	-9.55343
rhaps	-9.55371
▁per	-9.55546
▁fire	-9.55607
▁Ni	-9.55722
▁considerabl	-9.55757
▁build	-9.55794
▁entertain	-9.55805
ad	-9.55815
go	-9.56056
▁dry	-9.56211
T	-9.56288
▁wise	-9.56553
▁except	-9.566
▁involve	-9.56611
▁purpose	-9.56615
▁Sha	-9.56624
▁strength	-9.56661
▁bizarre	-9.56661
▁derivative	-9.56661
▁brutal	-9.56665
▁business	-9.56668
▁folk	-9.5667
▁ridiculous	-9.56681
▁Paul	-9.5669
▁development	-9.56691
▁spiritual	-9.56729
▁insightful	-9.56734
▁demand	-9.56807
▁depressing	-9.56905
▁generic	-9.56924
▁target	-9.56928
▁screenwriter	-9.56954
▁structure	-9.5696
▁bright	-9.57017
▁skill	-9.57034
ra	-9.57049
▁destin	-9.57089
▁finish	-9.57091
aid	-9.57093
▁living	-9.57118
▁apart	-9.57123
▁complicat	-9.5724
▁hate	-9.57291
▁slap	-9.57293
▁televis	-9.57302
▁cop	-9.577
elf	-9.5773
tion	-9.58031
▁ho	-9.58055
▁May	-9.58166
▁200	-9.58227
▁photograph	-9.58272
▁viewing	-9.58364
ture	-9.58446
▁centr	-9.58515
X	-9.58681
▁promising	-9.58864
dom	-9.59595
▁Da	-9.5965
▁creat	-9.59655
lin	-9.59784
▁struggle	-9.59833
track	-9.59971
▁st	-9.60037
▁chill	-9.60247
▁read	-9.60402
▁stop	-9.60426
▁played	-9.60481
style	-9.60639
field	-9.60797
▁exist	-9.60981
▁tough	-9.60997
▁Mur	-9.61036
conscious	-9.61104
▁cha	-9.61126
ven	-9.61195
ent	-9.61204
▁poet	-9.61234
▁portray	-9.61338
▁relentless	-9.61422
▁extraordinar	-9.61425
▁Sandler	-9.61426
▁Count	-9.61429
giving	-9.61448
▁colorful	-9.61458
abilit	-9.61462
▁chance	-9.615
▁money	-9.61504
▁Never	-9.6153
▁surface	-9.61543
▁Any	-9.6155
▁price	-9.61556
▁Sa	-9.61642
▁Guy	-9.6167
▁essential	-9.61698
▁spectacular	-9.6171
▁total	-9.61765
▁typical	-9.61818
▁check	-9.61966
▁South	-9.62049
▁authentic	-9.62061
▁mis	-9.62184
▁chase	-9.62238
▁punch	-9.62326
▁realistic	-9.62505
phy	-9.62584
▁badly	-9.62592
▁please	-9.62597
yourself	-9.62615
▁lame	-9.6267
▁trash	-9.62691
▁virtual	-9.62781
action	-9.62957
▁Ro	-9.63012
▁achieve	-9.63099
▁Mor	-9.63201
▁test	-9.63256
▁Dog	-9.63433
▁desire	-9.63535
▁mad	-9.63775
her	-9.63846
▁wor	-9.63925
▁rise	-9.64122
▁whe	-9.64169
▁stick	-9.64269
ries	-9.64378
shed	-9.64391
▁Me	-9.64448
▁seat	-9.64557
▁offering	-9.64645
▁Sh	-9.64807
▁studio	-9.64885
▁Pa	-9.65089
▁sports	-9.65176
▁Chan	-9.65226
fer	-9.65237
▁Ev	-9.6537
▁draw	-9.65392
▁90	-9.65482
live	-9.65489
▁Star	-9.65554
▁explore	-9.6576
▁loss	-9.65761
▁Rock	-9.65783
▁document	-9.65998
fel	-9.66131
ier	-9.66225
▁Ste	-9.66231
▁represent	-9.66291
▁atmospher	-9.66374
▁cinematograph	-9.66422
▁World	-9.66424
▁nuance	-9.66427
▁Wedding	-9.66428
▁Sweet	-9.66432
▁mesmeriz	-9.66448
▁incredibl	-9.66452
▁modest	-9.66477
▁relative	-9.6649
▁convey	-9.66509
▁Bull	-9.66521
▁minor	-9.66532
▁tender	-9.66564
▁imaginative	-9.66636
▁kick	-9.66685
▁broad	-9.66699
star	-9.66721
▁overcome	-9.66762
▁affecting	-9.66776
▁return	-9.6686
▁Scor	-9.6694
▁generation	-9.66954
▁frequent	-9.67014
▁disappointing	-9.67074
gal	-9.67075
▁intense	-9.67203
▁gay	-9.67249
hose	-9.67262
▁search	-9.67343
▁whims	-9.67347
▁center	-9.67492
▁color	-9.67556
▁Clo	-9.67564
▁realize	-9.67621
▁sleep	-9.67622
venge	-9.67662
▁lesson	-9.67737
▁talking	-9.67779
ether	-9.67827
gh	-9.67911
▁forget	-9.68159
▁require	-9.68481
▁She	-9.68524
▁mid	-9.68788
▁member	-9.68803
▁tire	-9.68885
▁type	-9.68906
▁basic	-9.69011
▁rock	-9.69082
▁performer	-9.69154
▁fare	-9.69217
zy	-9.69328
down	-9.69573
▁sh	-9.69765
mark	-9.69838
▁excite	-9.69984
rous	-9.70296
corn	-9.70312
chi	-9.70452
▁o	-9.7053
▁fashion	-9.70704
▁mo	-9.70707
▁artistic	-9.70737
▁poor	-9.70738
▁walk	-9.7076
▁believ	-9.70855
▁list	-9.7087
▁suit	-9.7088
▁anti	-9.70986
▁develop	-9.71008
▁master	-9.71033
▁fiction	-9.71262
told	-9.71391
de	-9.71466
hem	-9.71495
ould	-9.71608
▁theme	-9.71609
&	-9.71686
▁Solondz	-9.71686
▁Ultimate	-9.71686
▁glimpse	-9.71686
▁spectacle	-9.71686
▁undeniabl	-9.71686
▁victim	-9.71686
▁unintentional	-9.71687
▁constant	-9.71689
▁sketch	-9.7169
▁maintain	-9.7169
▁Dragon	-9.71696
▁Blade	-9.717
▁Black	-9.71705
▁choice	-9.71706
▁exploration	-9.71716
▁technical	-9.71719
▁Martin	-9.71723
▁amazing	-9.71731
▁Peter	-9.71741
▁slice	-9.71745
▁observation	-9.71749
▁source	-9.71752
▁ask	-9.71778
▁Sara	-9.71951
▁answer	-9.71976
▁intellectual	-9.71993
▁guilty	-9.72007
▁St	-9.72117
▁limit	-9.72179
▁Blue	-9.72183
▁apparent	-9.72192
▁guess	-9.72325
ensive	-9.72448
ut	-9.72544
▁challeng	-9.72583
▁carrie	-9.72592
▁inspiration	-9.72595
▁executi	-9.72596
spite	-9.72618
happy	-9.72725
ends	-9.7277
minded	-9.72788
▁engage	-9.72903
▁bold	-9.72928
ay	-9.72936
▁spot	-9.72955
▁intention	-9.73258
▁gun	-9.73274
▁means	-9.73374
▁aim	-9.73376
▁shake	-9.73532
▁poetic	-9.73557
▁spy	-9.73604
▁craz	-9.73774
ow	-9.73911
▁decades	-9.74401
▁bar	-9.75214
▁space	-9.75569
▁politic	-9.75809
▁Jo	-9.7585
▁length	-9.75891
▁appreciate	-9.75953
its	-9.76091
▁confus	-9.76092
▁transcend	-9.76154
▁group	-9.76213
pid	-9.76375
valent	-9.76623
▁Ya	-9.76636
ship	-9.7667
gged	-9.76793
▁strain	-9.76838
▁absurd	-9.76886
▁suck	-9.76898
▁party	-9.76901
▁Dam	-9.76908
sweet	-9.76972
▁Sad	-9.7713
▁produce	-9.77174
▁support	-9.77193
▁affection	-9.77233
▁computer	-9.77241
▁example	-9.77242
▁profound	-9.77243
▁yarn	-9.77244
▁amateurish	-9.77244
▁pretension	-9.77246
▁repetitive	-9.77248
▁giant	-9.77249
▁Brown	-9.77259
▁enter	-9.77266
▁Queen	-9.77268
▁annoying	-9.77269
▁favor	-9.77282
▁endearing	-9.77294
▁aspect	-9.77304
▁pa	-9.77315
mber	-9.7735
▁careful	-9.77405
▁Kev	-9.77416
▁grie	-9.77455
▁team	-9.77523
▁spoof	-9.7757
▁expectation	-9.7757
▁shallow	-9.77576
▁community	-9.77583
▁endless	-9.77631
▁laz	-9.77658
▁V	-9.7767
▁spend	-9.7768
▁commercial	-9.77782
▁Dead	-9.77846
conventional	-9.77846
▁moviegoer	-9.77857
▁indie	-9.77885
▁Play	-9.77948
▁trick	-9.77979
▁catch	-9.78063
▁musical	-9.78111
▁nonsens	-9.78119
▁raw	-9.78201
▁equi	-9.78292
long	-9.784
▁hell	-9.78562
▁regard	-9.78569
les	-9.78635
▁spark	-9.78691
▁accessib	-9.78781
▁Bir	-9.78864
elling	-9.7892
▁ver	-9.78937
▁rat	-9.79041
▁8	-9.79432
▁sight	-9.79485
erber	-9.79635
▁bo	-9.79662
▁kill	-9.79717
▁Ch	-9.79724
▁white	-9.7976
ings	-9.79765
▁accept	-9.79882
▁King	-9.80027
I	-9.80239
light	-9.80645
▁lyric	-9.81044
▁Mont	-9.81205
▁Cho	-9.8124
ise	-9.813
good	-9.81351
tory	-9.81659
▁Pol	-9.81726
room	-9.81754
▁Story	-9.81763
▁bu	-9.81842
night	-9.81925
▁cover	-9.82089
▁Will	-9.82219
▁exploit	-9.82311
▁age	-9.82358
▁shoot	-9.82478
▁Or	-9.82642
▁Night	-9.82824
▁Mi	-9.82838
▁dig	-9.82857
▁Sod	-9.8287
▁perspective	-9.83123
▁protagonist	-9.83123
▁unpleasant	-9.83126
▁affair	-9.83127
▁sitcom	-9.83127
▁Roger	-9.83128
▁Nichol	-9.8313
▁tribute	-9.8313
▁fur	-9.83144
▁societ	-9.83149
▁irritating	-9.83153
▁unfortunate	-9.83155
▁outrageous	-9.83158
▁Under	-9.83159
▁impression	-9.83171
▁exhilarating	-9.83172
▁trifle	-9.83191
▁precious	-9.83192
▁horribl	-9.832
▁striking	-9.83202
▁Over	-9.83242
unch	-9.83246
▁empty	-9.83306
▁service	-9.83311
▁connect	-9.83325
▁Much	-9.83326
▁beat	-9.83358
▁Pian	-9.83388
▁common	-9.83404
▁nowhere	-9.83426
▁gem	-9.83429
▁pointless	-9.83444
▁greatest	-9.83485
▁innocen	-9.8351
▁sentiment	-9.83558
▁Hour	-9.83572
▁Friday	-9.83816
▁manipulative	-9.83844
▁storyline	-9.83914
▁Power	-9.83933
ping	-9.84004
▁famili	-9.84193
▁smile	-9.84235
et	-9.84269
▁poorly	-9.84351
used	-9.84624
▁Hu	-9.84673
▁Bar	-9.84826
▁intend	-9.84941
▁week	-9.84977
ner	-9.84993
justice	-9.85039
▁fish	-9.85075
▁male	-9.8517
▁voice	-9.85196
▁Wood	-9.85204
▁aver	-9.85245
▁Chris	-9.85272
▁wry	-9.8531
▁paint	-9.85383
▁rip	-9.85386
▁wide	-9.85505
▁Roman	-9.85519
▁reading	-9.85577
L	-9.85844
▁spook	-9.85919
1	-9.85943
▁inner	-9.86105
▁sta	-9.86158
void	-9.86287
characterization	-9.86432
brid	-9.86486
▁pain	-9.86713
wood	-9.86813
▁His	-9.86875
▁escape	-9.86876
▁Red	-9.87179
back	-9.87717
our	-9.87775
▁step	-9.8778
▁reasonabl	-9.87883
top	-9.87961
well	-9.88101
▁Wil	-9.88361
▁disappoint	-9.88525
▁bore	-9.88534
▁critic	-9.88689
▁rent	-9.88791
▁hear	-9.88839
▁Of	-9.88883
▁surreal	-9.89006
▁metaphor	-9.89155
▁mistake	-9.89179
▁vehicle	-9.89373
▁scenario	-9.89374
▁positive	-9.89379
▁excess	-9.89386
▁Writer	-9.89388
▁clunk	-9.8939
▁unfold	-9.89402
▁masterful	-9.89421
▁vibran	-9.89426
▁vital	-9.89431
▁execut	-9.89432
▁slick	-9.89466
▁harm	-9.8949
▁settle	-9.89519
▁Fire	-9.89531
▁frustrating	-9.89533
▁shame	-9.89539
Man	-9.8955
▁universal	-9.89567
▁grim	-9.89626
▁stomach	-9.89703
▁daring	-9.89864
king	-9.89899
na	-9.89929
stream	-9.89945
▁consistent	-9.89953
fall	-9.90007
▁Kissing	-9.90019
▁Who	-9.90364
▁personalit	-9.90437
▁centur	-9.90645
▁Bear	-9.90723
▁Du	-9.90848
▁hair	-9.90871
▁sp	-9.90876
▁improve	-9.90917
house	-9.90933
▁behavio	-9.91032
hop	-9.91041
▁market	-9.91169
▁langu	-9.91222
ate	-9.91237
expected	-9.91271
▁eccentric	-9.91432
▁raise	-9.91432
▁Pinoc	-9.9149
company	-9.91551
▁4	-9.91662
pe	-9.91879
▁describe	-9.92143
▁determin	-9.92202
▁soft	-9.92331
▁exceptional	-9.92403
▁bored	-9.92431
▁Somet	-9.92622
▁fi	-9.9271
▁loose	-9.92914
work	-9.92921
▁trouble	-9.92936
▁Ra	-9.92956
▁seeming	-9.93071
ia	-9.93073
▁Wilde	-9.93127
▁willing	-9.93269
spirited	-9.93343
ick	-9.93476
cent	-9.93599
▁du	-9.93605
gger	-9.93643
▁Cra	-9.93696
uring	-9.93779
ntal	-9.93879
▁Ring	-9.94104
▁ab	-9.94308
▁sympath	-9.94423
▁Di	-9.94572
▁Moo	-9.94621
▁travel	-9.9467
▁Jam	-9.94797
▁goe	-9.9495
▁arrive	-9.94962
▁demonstrate	-9.94966
ideas	-9.95057
▁embarrass	-9.95154
▁soon	-9.95225
ge	-9.95321
C	-9.95489
▁Tu	-9.95519
ze	-9.95824
▁industr	-9.95847
▁Kaufman	-9.9604
▁individual	-9.9604
▁nostalgi	-9.9604
▁visceral	-9.9604
▁Beautiful	-9.9604
▁Italian	-9.96041
▁benefit	-9.96042
▁shadow	-9.96043
▁exquisite	-9.96044
▁conclusion	-9.96044
▁breathtaking	-9.96045
▁Greek	-9.96045
▁showcase	-9.96047
▁Life	-9.96049
▁proceed	-9.96052
▁incoheren	-9.96053
▁measure	-9.96055
▁Poke	-9.96056
▁Angel	-9.96057
▁conviction	-9.96057
▁beginning	-9.96059
▁display	-9.96065
▁tiresome	-9.96068
▁author	-9.96069
▁ambition	-9.96074
▁depiction	-9.96078
▁Arn	-9.96081
▁superb	-9.96095
▁resonance	-9.96113
▁courage	-9.96115
▁increasing	-9.96127
▁Ryan	-9.96139
▁Indian	-9.96158
▁spell	-9.96177
▁addition	-9.96216
▁angst	-9.96246
▁inept	-9.96256
ac	-9.9628
▁playful	-9.96385
▁professional	-9.96429
nes	-9.96434
▁condition	-9.96486
▁sick	-9.96494
▁Work	-9.96501
▁season	-9.96509
▁stale	-9.96579
▁slopp	-9.96605
▁sheer	-9.9665
▁adolescent	-9.967
▁banal	-9.96736
▁science	-9.96763
▁Take	-9.96792
▁winner	-9.96821
▁wife	-9.96858
0	-9.96904
▁intrigue	-9.96955
form	-9.96987
▁elegant	-9.9699
▁comfort	-9.97
▁pick	-9.97058
▁render	-9.97061
▁Nick	-9.97099
▁comedic	-9.97109
▁Burn	-9.9712
▁territor	-9.97185
▁spin	-9.972
▁state	-9.97259
▁unti	-9.97329
indulgent	-9.9733
▁Jon	-9.97431
▁Heav	-9.97502
▁complexit	-9.97508
class	-9.97581
▁admirabl	-9.97593
▁room	-9.97596
▁Rare	-9.97618
▁Ga	-9.97713
▁Y	-9.9779
▁escapis	-9.98128
ooper	-9.98184
natured	-9.98306
▁empath	-9.98316
▁overly	-9.98361
ud	-9.98508
▁bag	-9.98581
▁land	-9.98661
▁Per	-9.98854
▁Cru	-9.98856
▁divert	-9.98983
▁friends	-9.99053
rush	-9.99085
▁Fat	-9.99349
five	-9.99491
▁clums	-9.99494
▁relie	-9.995
pac	-9.9959
arine	-9.99656
▁Here	-9.99682
ice	-9.99916
▁pitch	-10.0013
▁discover	-10.0015
▁Wal	-10.0028
▁trapp	-10.0029
▁ages	-10.003
▁celebrat	-10.0039
▁exploitati	-10.0039
▁notion	-10.0062
nd	-10.0072
ced	-10.0074
▁cruel	-10.008
▁Broom	-10.011
tha	-10.0114
▁Luc	-10.0131
kin	-10.0138
wrenc	-10.0149
▁rough	-10.015
▁Cha	-10.0154
que	-10.0183
eur	-10.0185
▁tradition	-10.019
▁mysteri	-10.0192
▁dance	-10.0205
▁house	-10.0208
ties	-10.022
▁record	-10.0226
til	-10.0229
▁Ko	-10.0229
early	-10.0236
▁Far	-10.0236
▁report	-10.0248
talker	-10.0258
ntin	-10.0263
igni	-10.0264
▁ex	-10.0268
▁nei	-10.0281
tial	-10.0283
ically	-10.0284
▁Br	-10.0302
ext	-10.0307
ient	-10.0307
▁bottom	-10.0312
▁excu	-10.0313
▁holiday	-10.0318
▁landscape	-10.0318
▁Christmas	-10.0318
▁caution	-10.0318
▁similar	-10.0319
▁street	-10.0319
▁Iranian	-10.0319
▁villain	-10.0319
▁English	-10.0319
▁cloying	-10.0319
▁gangster	-10.0319
▁strict	-10.032
▁junk	-10.032
▁romp	-10.032
▁House	-10.0323
▁suspect	-10.0323
▁hi	-10.0323
▁mention	-10.0326
▁crude	-10.0328
▁hopeful	-10.033
▁overwr	-10.033
▁digital	-10.0332
▁heartbreaking	-10.0337
▁sober	-10.0338
▁account	-10.0346
▁Long	-10.0349
▁public	-10.035
▁Where	-10.0352
▁curious	-10.0356
▁specific	-10.0356
▁paper	-10.0357
▁obsession	-10.0357
▁Barry	-10.0358
▁gloss	-10.0363
foreign	-10.0365
▁breath	-10.0365
▁strike	-10.038
▁humorous	-10.0394
▁Harv	-10.0394
▁double	-10.0395
▁Zha	-10.041
▁ironic	-10.0411
face	-10.0416
▁stirr	-10.0425
▁grown	-10.0427
▁third	-10.0428
▁killer	-10.0431
▁Hard	-10.0436
▁difference	-10.0436
▁shocking	-10.0444
▁front	-10.0448
▁chilling	-10.045
▁wind	-10.0451
number	-10.0468
▁leav	-10.0475
ority	-10.0475
▁drawn	-10.0482
▁father	-10.0487
shop	-10.0494
length	-10.0496
▁po	-10.0501
▁mixed	-10.0508
▁loving	-10.0508
▁provid	-10.0526
▁Earn	-10.0531
ler	-10.0534
▁band	-10.0537
▁bother	-10.0542
▁suc	-10.0555
rate	-10.0564
▁race	-10.0568
▁admire	-10.0587
8	-10.0623
ces	-10.0631
▁buy	-10.0639
▁sa	-10.0644
guys	-10.0647
▁factor	-10.0648
▁nerve	-10.0657
els	-10.0663
ely	-10.0673
▁violent	-10.0679
no	-10.0687
lity	-10.0695
▁girls	-10.0699
▁Lane	-10.0708
▁forgot	-10.0713
▁games	-10.0714
▁generate	-10.0726
▁thinks	-10.074
turned	-10.0746
ha	-10.0776
▁Den	-10.0788
▁sophisticate	-10.0795
▁bodi	-10.081
ups	-10.0815
ugh	-10.0817
▁Ice	-10.0852
zing	-10.0862
▁Crime	-10.0864
▁Mill	-10.0868
tting	-10.0877
ith	-10.0885
▁Woo	-10.0889
▁persona	-10.0904
▁perform	-10.0923
core	-10.0926
▁rap	-10.0958
▁inde	-10.0974
▁night	-10.0979
▁pr	-10.0985
▁send	-10.0991
▁challenge	-10.0993
ittle	-10.0995
▁Frida	-10.0999
▁seek	-10.1006
thin	-10.1014
▁East	-10.1015
▁fa	-10.1029
▁finding	-10.103
ington	-10.1032
▁knowing	-10.1034
▁weight	-10.1051
▁bite	-10.1076
▁quest	-10.1086
ears	-10.1087
▁preposterous	-10.1088
ky	-10.1088
▁transform	-10.1088
▁degree	-10.1088
▁thousand	-10.1088
▁sugar	-10.1088
▁Christian	-10.1088
▁plodding	-10.1088
▁background	-10.1089
▁Bartle	-10.109
▁collection	-10.109
▁contrivance	-10.1091
▁dangerous	-10.1091
▁astonishing	-10.1091
▁Sex	-10.1092
▁smug	-10.1094
▁Reno	-10.1094
▁Robin	-10.1096
▁captivating	-10.1097
▁Hill	-10.1097
▁Wind	-10.1099
▁graphic	-10.1101
▁Wash	-10.1102
▁bigger	-10.1103
▁revelation	-10.1104
▁caper	-10.1104
▁pathetic	-10.1104
▁Harris	-10.1106
▁portrayal	-10.1109
▁treasure	-10.111
▁merit	-10.111
▁artful	-10.111
▁crass	-10.112
▁Still	-10.1121
▁smooth	-10.1122
▁corn	-10.1128
esque	-10.1128
▁early	-10.1133
▁blow	-10.1134
▁Call	-10.1143
cino	-10.115
▁decided	-10.1152
▁Swim	-10.1158
▁choose	-10.1161
ncy	-10.1163
▁Troubl	-10.1164
▁path	-10.1165
faith	-10.1167
▁abuse	-10.1171
holes	-10.1172
ious	-10.1173
▁hop	-10.1177
▁depend	-10.1179
▁identity	-10.1181
▁1	-10.1182
▁pat	-10.1182
▁gritt	-10.1187
▁linger	-10.1188
▁tap	-10.119
▁Off	-10.119
coming	-10.1203
▁assured	-10.1208
▁thematic	-10.1208
▁product	-10.121
▁silli	-10.121
▁string	-10.1227
▁fo	-10.1231
▁appropriate	-10.1236
▁tour	-10.1236
▁border	-10.1237
▁ga	-10.1237
70	-10.1241
writer	-10.125
▁Stu	-10.1257
▁Fear	-10.1263
▁Reig	-10.1264
▁retrea	-10.1273
ior	-10.1292
ek	-10.1295
▁disast	-10.1304
▁virtue	-10.1305
TV	-10.1311
▁belong	-10.1312
▁content	-10.1313
▁becom	-10.1314
weight	-10.1316
▁technolog	-10.1325
▁thrilling	-10.1329
▁Gangs	-10.1336
look	-10.1345
▁sides	-10.1346
▁Ri	-10.135
▁fairy	-10.1364
▁wall	-10.1365
ament	-10.1397
alone	-10.1409
▁sink	-10.141
aged	-10.1413
▁literal	-10.1415
▁Mal	-10.1421
▁push	-10.1431
▁nast	-10.1453
G	-10.1455
rely	-10.1469
▁lived	-10.1477
▁literar	-10.148
▁tight	-10.1484
deed	-10.1484
▁9	-10.1493
▁Water	-10.1502
▁decade	-10.1503
▁convince	-10.1506
▁distance	-10.1509
sion	-10.1513
▁distinct	-10.1531
▁pic	-10.1545
▁fool	-10.1547
▁card	-10.1561
any	-10.1561
ook	-10.1565
ag	-10.1567
▁Make	-10.1572
▁Cla	-10.1577
▁dud	-10.1579
▁tim	-10.158
▁logic	-10.1598
▁rush	-10.1599
berg	-10.1601
▁patien	-10.1606
atic	-10.1608
▁credib	-10.1609
▁fantastic	-10.1614
ette	-10.1632
▁control	-10.1633
▁Sm	-10.1639
ding	-10.1642
▁11	-10.1658
▁lea	-10.1667
▁Run	-10.1683
rage	-10.1691
loses	-10.1705
H	-10.1706
▁ru	-10.1728
4	-10.1761
lia	-10.1776
pan	-10.178
▁Vin	-10.1783
▁creativ	-10.1794
▁mental	-10.1797
ied	-10.1798
▁dreams	-10.1804
▁hook	-10.1813
appy	-10.1814
▁Die	-10.1814
ery	-10.1834
▁Gold	-10.1835
end	-10.1836
▁capabl	-10.1844
▁cult	-10.1846
▁bone	-10.186
▁teenage	-10.1861
meaning	-10.1878
▁Frank	-10.1878
roll	-10.1883
eless	-10.1895
▁prop	-10.1898
▁wa	-10.1904
▁curio	-10.1918
▁compassion	-10.1919
▁lose	-10.192
$	-10.1921
▁ingredient	-10.1921
▁intermittent	-10.1921
▁Hopkins	-10.1921
▁sensibilit	-10.1921
▁vague	-10.1921
▁ghost	-10.1921
▁uncomfortabl	-10.1921
▁encounter	-10.1921
▁marvel	-10.1921
▁grasp	-10.1922
▁heartwarming	-10.1922
▁delicious	-10.1922
▁dynamic	-10.1922
▁fluff	-10.1922
XX	-10.1922
▁Blood	-10.1923
▁raunch	-10.1923
▁Film	-10.1924
▁dazzling	-10.1924
▁false	-10.1924
▁mechanic	-10.1925
▁uninspir	-10.1926
▁current	-10.1926
▁diversion	-10.1927
▁devastating	-10.1927
▁trite	-10.1929
▁slasher	-10.193
▁breez	-10.1932
▁startling	-10.1934
▁Hugh	-10.1937
▁Out	-10.1938
alyze	-10.1938
table	-10.1939
▁frightening	-10.1939
▁includ	-10.194
▁redeem	-10.1942
luster	-10.1944
▁resonan	-10.1946
▁meandering	-10.1949
▁brother	-10.1952
▁connection	-10.1956
▁outside	-10.1959
▁jealous	-10.1963
▁artificial	-10.1964
▁Fatal	-10.1965
▁justify	-10.1967
▁significant	-10.197
▁reaction	-10.1979
▁popular	-10.1982
▁sensual	-10.1986
▁candy	-10.1989
▁amused	-10.1999
▁grip	-10.2001
▁swing	-10.2002
wrote	-10.2002
▁pile	-10.2003
▁Fest	-10.2004
▁Great	-10.2005
▁extend	-10.2005
▁deny	-10.2009
▁parable	-10.2014
▁Barber	-10.2014
hew	-10.2015
▁buoy	-10.202
▁resist	-10.2029
▁chuckle	-10.2036
ages	-10.2041
▁cheer	-10.2044
v	-10.2045
pped	-10.2046
▁Scott	-10.2053
▁Wa	-10.2058
▁reduce	-10.2083
▁Mo	-10.2086
▁Hart	-10.2087
▁load	-10.2099
▁traditional	-10.2105
▁likable	-10.2114
▁clash	-10.2127
American	-10.2135
▁gut	-10.2135
wacky	-10.2142
la	-10.2143
▁drea	-10.2144
▁shooting	-10.2146
▁clari	-10.2154
▁chees	-10.2159
▁starr	-10.2166
▁competent	-10.2168
oyan	-10.217
▁hot	-10.217
▁risk	-10.2187
K	-10.2188
▁Mad	-10.22
▁fly	-10.22
book	-10.22
ol	-10.221
▁fate	-10.2217
▁Sp	-10.2221
joint	-10.2223
▁pit	-10.2228
O	-10.2231
dimension	-10.2245
mission	-10.2266
mo	-10.2268
▁Charl	-10.2278
▁extra	-10.2283
gio	-10.2287
▁Master	-10.2292
▁dare	-10.2307
ans	-10.2318
ations	-10.2325
▁earn	-10.235
▁tast	-10.2371
cute	-10.2372
▁Pl	-10.2374
▁Pe	-10.238
▁cost	-10.2386
▁Sam	-10.2408
▁featur	-10.241
▁Mik	-10.2415
▁surviv	-10.2421
▁poignanc	-10.2421
▁cour	-10.2423
llen	-10.2453
▁Tru	-10.2454
▁hang	-10.2459
▁neat	-10.2461
▁handle	-10.2466
▁hole	-10.2468
rian	-10.2476
▁bigge	-10.248
evil	-10.2488
stick	-10.2492
▁winds	-10.2493
place	-10.2523
▁player	-10.2523
come	-10.2523
udic	-10.2565
ffle	-10.2572
drum	-10.2573
film	-10.2578
▁Reg	-10.2603
▁court	-10.2635
▁awe	-10.2635
ttraction	-10.2636
ival	-10.2648
▁Fra	-10.2668
▁twi	-10.2668
▁notice	-10.267
born	-10.2675
▁poli	-10.2679
ps	-10.2686
▁youth	-10.2697
ense	-10.271
▁Jan	-10.2736
use	-10.2747
▁resemble	-10.2753
eath	-10.2756
art	-10.2759
bad	-10.276
▁topic	-10.2762
craft	-10.278
▁labor	-10.2789
▁freak	-10.279
▁sea	-10.2791
▁arts	-10.2792
ake	-10.2797
eke	-10.28
▁bla	-10.281
ast	-10.2811
7	-10.2811
▁include	-10.2815
▁drop	-10.2815
ok	-10.2819
▁Han	-10.2823
▁Schneider	-10.283
▁inexplicabl	-10.283
▁intricate	-10.283
▁elevate	-10.283
▁matinee	-10.283
▁remote	-10.283
▁Ghost	-10.283
▁bleak	-10.283
▁Dickens	-10.283
▁wannabe	-10.2831
▁stiff	-10.2831
▁homage	-10.2831
▁enormous	-10.2832
▁fierce	-10.2832
▁Trek	-10.2832
▁splendid	-10.2832
▁window	-10.2832
▁built	-10.2832
▁kiddie	-10.2833
▁pathos	-10.2833
▁explosion	-10.2834
▁handsome	-10.2834
▁ponder	-10.2834
inducing	-10.2835
▁Scooby	-10.2835
▁movement	-10.2836
▁pulp	-10.2836
▁ticket	-10.2836
▁sogg	-10.2836
▁achievement	-10.2837
▁Witch	-10.2837
▁embrace	-10.2838
▁repeated	-10.2838
▁revelat	-10.2839
▁inherent	-10.284
▁Yu	-10.2841
▁gender	-10.2842
▁accent	-10.2844
▁cutting	-10.2844
▁dysfunctional	-10.2845
▁theatrical	-10.2846
▁Look	-10.2846
▁forceful	-10.2847
▁Murder	-10.2847
▁marri	-10.2849
▁Wall	-10.2856
▁square	-10.2856
▁ruin	-10.2861
▁nightmare	-10.2863
▁preachy	-10.2867
▁le	-10.2869
▁student	-10.287
▁Extreme	-10.2871
▁lump	-10.2872
▁experiment	-10.2873
▁channel	-10.2876
▁uplift	-10.2876
▁Spider	-10.2876
▁humour	-10.2876
do	-10.2878
▁Russian	-10.2878
▁steal	-10.2879
writ	-10.2885
sive	-10.2893
▁carry	-10.2896
▁corner	-10.2896
▁food	-10.29
▁ear	-10.2902
▁tir	-10.2907
▁inane	-10.2908
▁stock	-10.2914
▁Hawk	-10.2923
orient	-10.2924
▁education	-10.2925
▁erotic	-10.293
▁Mark	-10.293
▁DV	-10.2931
▁maker	-10.2934
▁order	-10.294
▁teenager	-10.2947
▁Anne	-10.2948
▁Van	-10.2948
▁creation	-10.2949
▁precise	-10.295
▁vulgar	-10.2951
▁sla	-10.2954
implicit	-10.2955
▁urge	-10.2957
▁scare	-10.2958
▁wi	-10.296
▁sac	-10.2963
round	-10.2981
drama	-10.2989
▁Less	-10.2994
▁burst	-10.2998
rid	-10.2998
▁Bros	-10.3014
yam	-10.3029
▁En	-10.3031
▁earth	-10.3062
dish	-10.3074
▁Matt	-10.3076
▁accomplish	-10.3082
▁Rich	-10.3085
nity	-10.3086
ying	-10.3112
▁fu	-10.3115
ended	-10.3116
▁Sever	-10.3123
haps	-10.3125
▁cris	-10.3127
▁continu	-10.3131
▁199	-10.3135
▁cheat	-10.3135
aking	-10.3138
▁coheren	-10.3143
▁cause	-10.3145
board	-10.3159
▁Vi	-10.317
rium	-10.3184
▁baffl	-10.3205
ike	-10.3205
belief	-10.3209
eir	-10.3212
free	-10.3216
ents	-10.3219
▁forgive	-10.3221
▁sho	-10.3229
aked	-10.3229
brow	-10.3236
▁Pal	-10.3237
familiar	-10.3239
▁admit	-10.3243
mentary	-10.3256
▁sour	-10.3259
▁disguise	-10.3262
▁imagin	-10.3263
hold	-10.3267
met	-10.3267
ks	-10.3273
▁parad	-10.3273
der	-10.3275
ster	-10.3277
▁bi	-10.3288
oes	-10.329
▁Lil	-10.3297
boy	-10.3299
▁Fish	-10.3301
▁li	-10.3303
▁dispos	-10.3309
▁lift	-10.331
▁goal	-10.3316
ite	-10.3317
▁sophisticat	-10.3332
▁Fa	-10.3334
▁Suff	-10.3343
▁shape	-10.3349
▁prim	-10.3363
▁Son	-10.3365
▁Bill	-10.3373
▁Bla	-10.3377
caust	-10.3379
▁aware	-10.3387
▁nerv	-10.3413
upper	-10.3442
▁Real	-10.3443
▁dose	-10.3445
▁luck	-10.3446
▁Michel	-10.3454
ache	-10.3466
ions	-10.348
▁sport	-10.3482
▁par	-10.35
▁Hay	-10.3507
3	-10.3514
▁Fun	-10.3517
▁Am	-10.3529
▁Joe	-10.3544
00	-10.3554
▁accomplishe	-10.3555
▁produc	-10.3579
▁Wo	-10.3588
▁fr	-10.3603
▁Jer	-10.3609
range	-10.3625
▁captur	-10.3643
▁Harr	-10.3658
▁Jacqu	-10.3676
▁believab	-10.3678
▁prison	-10.3689
ttle	-10.3691
ppers	-10.37
udo	-10.3701
▁Pow	-10.3707
ped	-10.3711
port	-10.3712
▁Whe	-10.3712
▁uncom	-10.3717
▁categor	-10.3737
aga	-10.3743
▁Kiss	-10.3753
xed	-10.3762
▁crap	-10.3769
▁humanit	-10.3787
▁15	-10.3789
onic	-10.3811
▁Don	-10.3816
Ya	-10.3827
▁Chabrol	-10.383
▁Chicago	-10.383
▁gimmick	-10.383
▁implausib	-10.383
▁obnoxious	-10.383
▁unabashed	-10.383
▁comparison	-10.383
▁demographic	-10.383
▁inevitabl	-10.383
▁ingenious	-10.383
▁inhabit	-10.383
▁Irwin	-10.383
▁Sugar	-10.383
▁enthusiasm	-10.383
▁random	-10.383
▁unimaginative	-10.383
▁possibilit	-10.383
▁horrifying	-10.383
▁elaborate	-10.383
▁intoxicating	-10.383
▁tongue	-10.383
▁husband	-10.3831
▁disgust	-10.3831
▁casual	-10.3831
▁legend	-10.3831
▁hollow	-10.3831
▁decide	-10.3831
▁scatter	-10.3831
▁pedest	-10.3831
▁dreadful	-10.3831
▁dismiss	-10.3832
▁Strange	-10.3833
▁brief	-10.3833
▁smack	-10.3834
▁Worth	-10.3834
▁marvelous	-10.3834
▁Philip	-10.3835
▁attitude	-10.3835
▁endeavor	-10.3835
▁aimless	-10.3836
▁Dream	-10.3836
▁creature	-10.3836
▁boast	-10.3836
▁distract	-10.3837
▁expert	-10.3837
▁instant	-10.3841
▁Jean	-10.3842
▁comfortabl	-10.3843
ibal	-10.3844
▁sister	-10.3844
▁restrain	-10.3848
▁frank	-10.3849
▁51	-10.3849
▁proper	-10.3849
▁eloquent	-10.385
▁muddle	-10.3856
▁crisp	-10.3861
▁Fan	-10.3863
▁spring	-10.3864
▁ball	-10.3866
▁blast	-10.3867
▁effortless	-10.3867
▁hide	-10.3867
▁witness	-10.3868
▁Have	-10.387
ming	-10.3871
▁listen	-10.3871
▁fee	-10.3876
▁apply	-10.3876
▁buff	-10.3877
▁laughing	-10.3877
▁glorious	-10.3877
▁correct	-10.3879
▁vampire	-10.388
▁minimal	-10.388
▁broken	-10.3882
▁jolt	-10.3884
▁marginal	-10.3888
▁contain	-10.3889
▁borrow	-10.3891
▁aggressive	-10.3893
iz	-10.3894
▁larger	-10.3897
▁vein	-10.3897
▁Haw	-10.3902
▁machine	-10.3906
▁review	-10.3908
▁alternate	-10.3909
▁surrounding	-10.391
▁Sunda	-10.391
hilosophical	-10.3915
▁Manh	-10.3916
heir	-10.393
ide	-10.3931
▁nail	-10.3935
▁stereotype	-10.3935
▁due	-10.3937
▁adequate	-10.3943
▁theatre	-10.3944
▁commit	-10.3944
comedy	-10.3945
▁box	-10.3947
▁million	-10.3951
▁consciousness	-10.3951
bo	-10.3951
▁Give	-10.396
▁copy	-10.3969
▁tend	-10.3971
des	-10.3974
iling	-10.3976
▁menac	-10.3977
▁Kapu	-10.3979
raid	-10.3979
un	-10.3988
stic	-10.3989
▁Warm	-10.3989
▁Hell	-10.399
▁lovers	-10.3991
cover	-10.3991
▁layer	-10.3993
▁Live	-10.3997
▁3	-10.4
ndon	-10.4003
ded	-10.4004
▁office	-10.4005
▁Shakespeare	-10.4011
▁physical	-10.402
▁West	-10.403
lo	-10.4031
▁noneth	-10.4035
ating	-10.4037
▁intens	-10.405
▁Gre	-10.4051
▁Mel	-10.4065
▁Fi	-10.4067
▁objectiv	-10.4084
▁fake	-10.4091
lines	-10.4093
▁Ha	-10.4114
sai	-10.4121
▁lower	-10.4123
▁pleasing	-10.4124
rish	-10.4132
▁fantasi	-10.4134
▁ordina	-10.4144
ore	-10.4148
promising	-10.415
▁calculat	-10.4153
ourne	-10.4156
▁gradua	-10.4157
▁charge	-10.4165
▁cable	-10.4165
list	-10.418
▁stretch	-10.419
ta	-10.4194
▁fla	-10.4194
natural	-10.4215
worth	-10.4221
kov	-10.4241
oney	-10.4255
▁celebrate	-10.4258
video	-10.4272
prise	-10.428
▁sto	-10.4285
ern	-10.4295
▁Bu	-10.4298
intention	-10.43
60	-10.431
▁Prov	-10.4314
lor	-10.4315
▁Hot	-10.4323
▁Sum	-10.4329
oman	-10.4329
laris	-10.4337
▁presen	-10.4347
necessar	-10.4351
▁honor	-10.4369
ask	-10.4374
▁examine	-10.4379
▁clumsi	-10.4379
▁Bi	-10.4387
▁Can	-10.4389
▁limp	-10.439
▁fanci	-10.439
done	-10.4391
together	-10.4396
▁understate	-10.4398
grade	-10.4403
▁ignore	-10.4406
▁pun	-10.4428
ection	-10.4428
But	-10.4436
▁gang	-10.4436
mination	-10.4443
am	-10.4452
rath	-10.446
▁flo	-10.4462
▁See	-10.4472
▁Start	-10.449
▁award	-10.4501
▁Kur	-10.4508
▁hy	-10.451
nan	-10.4513
▁198	-10.4519
▁Brother	-10.452
▁lie	-10.4522
▁bog	-10.4523
▁Ala	-10.4525
▁Pay	-10.4538
lie	-10.454
▁shine	-10.4545
ov	-10.4546
▁cho	-10.4548
▁national	-10.4557
▁express	-10.4569
witt	-10.4572
▁slip	-10.4606
ig	-10.4621
▁hype	-10.4623
▁integr	-10.4628
▁phone	-10.4631
having	-10.4632
flinching	-10.4636
ors	-10.4642
ace	-10.4645
ustin	-10.4657
loud	-10.4662
▁ju	-10.4666
▁197	-10.4676
▁desperat	-10.4681
▁ro	-10.4688
▁Leg	-10.4696
ump	-10.4698
▁Dani	-10.4701
uff	-10.4709
▁eno	-10.471
▁Ric	-10.4712
bilit	-10.4712
▁lend	-10.4713
▁bath	-10.4722
▁spen	-10.4723
▁mu	-10.4724
akes	-10.4731
ged	-10.4731
▁Tara	-10.4739
▁instinct	-10.474
▁Wi	-10.4758
▁multi	-10.4764
▁30	-10.4767
▁myth	-10.4769
▁friend	-10.4772
ab	-10.4773
▁blue	-10.478
stract	-10.4782
ourse	-10.4785
ering	-10.4807
▁die	-10.4812
▁Ku	-10.4813
earing	-10.4815
▁Cinema	-10.4823
▁bear	-10.4824
alan	-10.4839
▁torture	-10.4839
▁Cu	-10.4845
▁despair	-10.4848
▁Ka	-10.4849
war	-10.486
▁scream	-10.4864
▁skip	-10.4876
rk	-10.4885
▁continue	-10.4894
▁End	-10.4895
ved	-10.4897
tuck	-10.491
magine	-10.4919
fan	-10.4921
▁primar	-10.4924
▁involv	-10.4935
▁Rob	-10.4936
knowledge	-10.4937
▁depart	-10.494
▁Schaef	-10.4941
▁claustrophobi	-10.4941
▁irresistibl	-10.4941
▁vintage	-10.4941
▁controvers	-10.4941
▁unbearabl	-10.4941
▁consequence	-10.4941
▁installment	-10.4941
mpeccabl	-10.4941
▁backdrop	-10.4941
▁subplot	-10.4941
▁existential	-10.4941
▁monoton	-10.4942
▁European	-10.4942
▁sentence	-10.4942
▁glib	-10.4942
▁Remember	-10.4942
▁German	-10.4942
▁unforgettabl	-10.4942
▁environment	-10.4942
GI	-10.4942
▁spontane	-10.4942
▁Return	-10.4942
▁accurate	-10.4943
▁immediate	-10.4943
▁succumb	-10.4943
▁murk	-10.4944
▁Sister	-10.4944
▁squander	-10.4944
▁drab	-10.4944
▁grab	-10.4944
▁sudden	-10.4945
▁collective	-10.4945
▁device	-10.4945
▁ponderous	-10.4946
▁unoriginal	-10.4946
▁variation	-10.4946
▁rival	-10.4947
▁depict	-10.4947
▁Ecks	-10.4947
▁unnerv	-10.4948
▁Half	-10.4949
▁rapid	-10.4949
▁Kenne	-10.495
▁reject	-10.4951
▁aspiration	-10.4954
▁Light	-10.4954
▁shameless	-10.4955
▁Korean	-10.4955
▁six	-10.4956
▁Freak	-10.4956
▁Side	-10.4959
▁yearning	-10.4959
▁paranoi	-10.4961
▁Camp	-10.4962
▁warning	-10.4962
▁independent	-10.4962
▁grating	-10.4962
▁hyper	-10.4965
▁vast	-10.4966
▁invest	-10.4967
▁Roh	-10.4967
holds	-10.4969
▁flow	-10.497
▁reference	-10.497
▁pretend	-10.4974
▁screenwrit	-10.4976
▁drown	-10.498
▁blank	-10.4983
▁perverse	-10.4983
ered	-10.4984
▁wound	-10.4985
▁chopp	-10.4988
▁text	-10.4988
▁Other	-10.4993
▁Eg	-10.4995
▁insulting	-10.4996
▁stylistic	-10.4997
▁shift	-10.4998
▁sweep	-10.5003
rity	-10.5007
bound	-10.5007
▁pan	-10.501
eacher	-10.5011
▁serial	-10.5012
▁arrest	-10.5016
▁came	-10.5016
▁web	-10.5016
▁stil	-10.5018
▁screaming	-10.5022
▁Jona	-10.5022
feld	-10.5022
▁potent	-10.5028
han	-10.5029
attan	-10.5035
iccol	-10.5038
▁brand	-10.5039
fest	-10.5043
▁comment	-10.5045
▁patient	-10.5046
▁gore	-10.5048
▁ego	-10.5052
▁resembl	-10.5063
▁smarter	-10.5066
▁miserabl	-10.5068
▁substitute	-10.5071
▁Tay	-10.5072
▁resolute	-10.5077
▁buddy	-10.5081
▁Spirit	-10.5085
▁Hann	-10.5087
opic	-10.509
os	-10.5094
▁parod	-10.5096
▁bump	-10.5097
▁location	-10.5103
taken	-10.5106
▁knock	-10.5113
▁noble	-10.5121
▁sympathetic	-10.5131
▁icon	-10.5133
ave	-10.5141
▁park	-10.5142
oc	-10.5145
▁imp	-10.5145
▁melanchol	-10.5146
more	-10.5147
▁pair	-10.5147
▁Gra	-10.5149
▁weep	-10.5149
▁Age	-10.5159
▁Kin	-10.5164
▁building	-10.5166
▁hint	-10.5166
▁Jud	-10.5172
▁Impost	-10.5174
rew	-10.5178
▁Wise	-10.5179
▁fam	-10.5182
▁Part	-10.5186
phen	-10.5192
▁critical	-10.5192
▁mouth	-10.5194
▁heavi	-10.5208
ja	-10.5215
▁distinguish	-10.5215
▁Wol	-10.5221
wear	-10.5224
vern	-10.5232
▁Hol	-10.5235
ux	-10.524
trip	-10.5243
▁pot	-10.5247
▁jar	-10.5252
▁Sor	-10.5252
ella	-10.5252
▁recognize	-10.5263
ell	-10.5264
▁Tuck	-10.5266
joke	-10.5267
▁offend	-10.5267
ilty	-10.5277
▁page	-10.5279
▁Lack	-10.5281
▁height	-10.5286
▁Min	-10.5291
▁reflect	-10.5291
▁train	-10.5296
▁satisfie	-10.5297
▁195	-10.5297
▁Rose	-10.53
older	-10.5303
anks	-10.5319
▁styl	-10.5319
▁deni	-10.5327
▁substan	-10.5343
▁practical	-10.5359
sel	-10.5361
med	-10.5363
▁Sav	-10.5367
▁dub	-10.5381
tech	-10.5386
▁wood	-10.5397
▁ten	-10.5398
▁phon	-10.5402
▁evoke	-10.5405
▁la	-10.5406
▁Bur	-10.5414
ash	-10.5425
▁Jess	-10.5432
▁Pott	-10.5436
thriller	-10.5437
lace	-10.5442
idden	-10.5446
▁Cann	-10.5453
▁danc	-10.5454
we	-10.5457
