{
  "Effective": 2,
  "but": 1428,
  "too-tepid": 1,
  "biopic": 8,
  "If": 202,
  "you": 1009,
  "sometimes": 64,
  "like": 578,
  "to": 3959,
  "go": 105,
  "the": 7890,
  "movies": 204,
  "have": 595,
  "fun": 153,
  ",": 9376,
  "Wasabi": 2,
  "is": 3339,
  "a": 5740,
  "good": 329,
  "place": 58,
  "start": 30,
  ".": 10684,
  "Emerges": 1,
  "as": 1586,
  "something": 176,
  "rare": 48,
  "an": 975,
  "issue": 12,
  "movie": 1247,
  "that": 2467,
  "'s": 3291,
  "so": 487,
  "honest": 38,
  "and": 5727,
  "keenly": 2,
  "observed": 5,
  "it": 2376,
  "does": 384,
  "n't": 903,
  "feel": 123,
  "one": 598,
  "The": 1646,
  "film": 1502,
  "provides": 22,
  "some": 274,
  "great": 144,
  "insight": 31,
  "into": 390,
  "neurotic": 4,
  "mindset": 4,
  "of": 5698,
  "all": 542,
  "comics": 5,
  "--": 693,
  "even": 284,
  "those": 153,
  "who": 406,
  "reached": 4,
  "absolute": 6,
  "top": 15,
  "game": 36,
  "Offers": 15,
  "combination": 17,
  "entertainment": 78,
  "education": 5,
  "Perhaps": 9,
  "no": 308,
  "picture": 120,
  "ever": 131,
  "made": 179,
  "has": 645,
  "more": 655,
  "literally": 8,
  "showed": 1,
  "road": 17,
  "hell": 15,
  "paved": 2,
  "with": 1397,
  "intentions": 14,
  "Steers": 6,
  "turns": 55,
  "in": 2355,
  "snappy": 7,
  "screenplay": 59,
  "curls": 1,
  "at": 620,
  "edges": 7,
  ";": 128,
  "clever": 66,
  "want": 80,
  "hate": 18,
  "But": 136,
  "he": 253,
  "somehow": 17,
  "pulls": 16,
  "off": 153,
  "Take": 8,
  "Care": 5,
  "My": 43,
  "Cat": 5,
  "offers": 55,
  "refreshingly": 19,
  "different": 39,
  "slice": 18,
  "Asian": 7,
  "cinema": 75,
  "This": 358,
  "well": 181,
  "worth": 90,
  "seeing": 40,
  "talking": 17,
  "singing": 7,
  "heads": 8,
  "What": 153,
  "really": 184,
  "surprises": 26,
  "about": 662,
  "Wisegirls": 2,
  "its": 1231,
  "low-key": 13,
  "quality": 31,
  "genuine": 31,
  "tenderness": 5,
  "-LRB-": 7,
  "Wendigo": 6,
  "-RRB-": 7,
  "why": 63,
  "we": 214,
  ":": 204,
  "be": 886,
  "fed": 1,
  "through": 185,
  "eye": 23,
  "heart": 105,
  "mind": 52,
  "One": 111,
  "greatest": 16,
  "family-oriented": 2,
  "fantasy-adventure": 2,
  "Ultimately": 15,
  "ponders": 1,
  "reasons": 6,
  "need": 72,
  "stories": 42,
  "much": 342,
  "An": 254,
  "utterly": 26,
  "compelling": 90,
  "`": 306,
  "wrote": 9,
  "'": 503,
  "which": 228,
  "reputation": 5,
  "most": 362,
  "famous": 9,
  "author": 8,
  "lived": 11,
  "comes": 101,
  "question": 24,
  "Illuminating": 1,
  "if": 315,
  "overly": 15,
  "talky": 6,
  "documentary": 121,
  "A": 1158,
  "masterpiece": 22,
  "four": 25,
  "years": 88,
  "making": 72,
  "ripe": 8,
  "enrapturing": 1,
  "beauty": 23,
  "will": 343,
  "tempt": 1,
  "willing": 13,
  "probe": 5,
  "inscrutable": 1,
  "mysteries": 8,
  "breath": 9,
  "fresh": 49,
  "air": 28,
  "true": 64,
  "sophistication": 2,
  "thoughtful": 32,
  "provocative": 25,
  "insistently": 2,
  "humanizing": 4,
  "With": 78,
  "cast": 145,
  "includes": 6,
  "actors": 94,
  "working": 23,
  "independent": 8,
  "Lovely": 7,
  "&": 19,
  "Amazing": 6,
  "involves": 2,
  "us": 222,
  "because": 121,
  "incisive": 7,
  "bleakly": 1,
  "amusing": 56,
  "how": 163,
  "our": 89,
  "lives": 46,
  "disturbing": 21,
  "frighteningly": 4,
  "evocative": 11,
  "assembly": 3,
  "imagery": 16,
  "hypnotic": 6,
  "music": 79,
  "composed": 7,
  "by": 709,
  "Philip": 8,
  "Glass": 9,
  "Not": 83,
  "for": 1272,
  "everyone": 46,
  "whom": 12,
  "connect": 9,
  "nice": 29,
  "departure": 6,
  "from": 613,
  "standard": 22,
  "moviegoing": 7,
  "fare": 20,
  "Scores": 2,
  "few": 129,
  "points": 30,
  "doing": 30,
  "what": 300,
  "dedicated": 1,
  "good-hearted": 4,
  "professionalism": 4,
  "Occasionally": 7,
  "melodramatic": 23,
  "also": 145,
  "extremely": 20,
  "effective": 28,
  "idealistic": 3,
  "love": 182,
  "story": 454,
  "brings": 20,
  "out": 363,
  "latent": 1,
  "15-year-old": 2,
  "romantic": 108,
  "At": 52,
  "95": 3,
  "minutes": 122,
  "Treasure": 8,
  "Planet": 7,
  "maintains": 8,
  "brisk": 6,
  "pace": 27,
  "races": 4,
  "familiar": 55,
  "However": 7,
  "lacks": 52,
  "grandeur": 11,
  "epic": 33,
  "often": 117,
  "associated": 4,
  "Stevenson": 8,
  "tale": 118,
  "earlier": 9,
  "Disney": 37,
  "efforts": 17,
  "It": 903,
  "helps": 10,
  "Lil": 5,
  "Bow": 6,
  "Wow": 9,
  "...": 800,
  "tones": 6,
  "down": 112,
  "his": 566,
  "pint-sized": 2,
  "gangsta": 1,
  "act": 31,
  "play": 51,
  "someone": 29,
  "resembles": 8,
  "real": 118,
  "kid": 18,
  "Guaranteed": 1,
  "move": 15,
  "anyone": 75,
  "shook": 1,
  "rattled": 1,
  "or": 471,
  "rolled": 3,
  "masterful": 9,
  "master": 17,
  "filmmaker": 52,
  "unique": 21,
  "deceptive": 1,
  "grimness": 1,
  "fatalist": 1,
  "worldview": 1,
  "Light": 4,
  "cute": 23,
  "forgettable": 21,
  "there": 236,
  "way": 276,
  "effectively": 9,
  "teach": 4,
  "kids": 71,
  "dangers": 2,
  "drugs": 10,
  "I": 557,
  "think": 83,
  "projects": 7,
  "unfortunately": 12,
  "R-rated": 2,
  "Paid": 5,
  "While": 90,
  "would": 224,
  "easy": 49,
  "give": 73,
  "Crush": 22,
  "new": 143,
  "title": 67,
  "Two": 18,
  "Weddings": 4,
  "Funeral": 4,
  "far": 122,
  "than": 609,
  "any": 205,
  "Hugh": 11,
  "Grant": 27,
  "whimsy": 11,
  "Though": 66,
  "everything": 50,
  "might": 142,
  "literate": 6,
  "smart": 50,
  "never": 227,
  "took": 11,
  "always": 66,
  "seemed": 10,
  "static": 8,
  "Cantet": 2,
  "perfectly": 31,
  "captures": 26,
  "hotel": 4,
  "lobbies": 1,
  "two-lane": 1,
  "highways": 2,
  "roadside": 1,
  "cafes": 1,
  "permeate": 1,
  "Vincent": 11,
  "days": 31,
  "Ms.": 18,
  "Fulford-Wierzbicki": 2,
  "almost": 110,
  "spooky": 13,
  "her": 170,
  "sulky": 2,
  "calculating": 3,
  "Lolita": 3,
  "turn": 40,
  "means": 20,
  "best": 210,
  "work": 220,
  "Laissez-Passer": 1,
  "distinguished": 5,
  "distinctive": 10,
  "effort": 54,
  "bona-fide": 1,
  "fascinating": 75,
  "replete": 7,
  "rewards": 7,
  "had": 103,
  "make": 256,
  "reap": 2,
  "them": 177,
  "Like": 92,
  "Bond": 23,
  "outings": 1,
  "recent": 48,
  "stunts": 17,
  "are": 689,
  "outlandish": 4,
  "they": 232,
  "border": 3,
  "on": 810,
  "being": 138,
  "cartoonlike": 1,
  "heavy": 24,
  "reliance": 3,
  "CGI": 9,
  "technology": 10,
  "beginning": 13,
  "creep": 2,
  "series": 68,
  "Newton": 3,
  "draws": 10,
  "attention": 32,
  "magnet": 1,
  "acts": 10,
  "circles": 3,
  "around": 63,
  "better": 152,
  "known": 7,
  "co-star": 1,
  "Mark": 9,
  "Wahlberg": 4,
  "loses": 21,
  "bite": 12,
  "last-minute": 3,
  "happy": 16,
  "ending": 48,
  "less": 118,
  "plausible": 2,
  "rest": 26,
  "Much": 16,
  "though": 80,
  "this": 1029,
  "novel": 30,
  "ride": 45,
  "Fuller": 1,
  "surely": 14,
  "called": 22,
  "gutsy": 2,
  "times": 95,
  "exhilarating": 16,
  "yarn": 16,
  "makes": 226,
  "strong": 52,
  "case": 37,
  "importance": 5,
  "musicians": 3,
  "creating": 12,
  "Motown": 4,
  "sound": 25,
  "Karmen": 1,
  "moves": 13,
  "rhythm": 10,
  "itself": 110,
  "lips": 2,
  "chanting": 1,
  "beat": 14,
  "long": 151,
  "braided": 1,
  "hair": 10,
  "little": 270,
  "wipe": 1,
  "away": 71,
  "jeweled": 1,
  "beads": 1,
  "sweat": 3,
  "Gosling": 6,
  "amazing": 13,
  "performance": 129,
  "dwarfs": 1,
  "else": 54,
  "people": 166,
  "gives": 77,
  "glimpse": 15,
  "culture": 46,
  "do": 244,
  "know": 81,
  "Tender": 1,
  "yet": 106,
  "lacerating": 1,
  "darkly": 9,
  "funny": 263,
  "fable": 13,
  "May": 12,
  "spoofing": 2,
  "target": 18,
  "old": 94,
  "50": 4,
  "giant": 16,
  "creature": 5,
  "features": 10,
  "acknowledges": 4,
  "celebrates": 9,
  "their": 271,
  "cheesiness": 1,
  "reason": 48,
  "get": 157,
  "kick": 8,
  "watching": 84,
  "today": 19,
  "engaging": 60,
  "overview": 3,
  "Johnson": 3,
  "eccentric": 13,
  "career": 26,
  "In": 121,
  "ragged": 3,
  "cheap": 26,
  "unassuming": 4,
  "works": 79,
  "Some": 38,
  "charisma": 16,
  "'d": 59,
  "listen": 8,
  "reading": 16,
  "phone": 4,
  "book": 41,
  "Sandra": 8,
  "Bullock": 18,
  "two": 150,
  "such": 120,
  "likeable": 5,
  "Nettelbeck": 5,
  "beautifully": 42,
  "orchestrates": 1,
  "transformation": 5,
  "chilly": 8,
  "self-absorbed": 3,
  "Martha": 13,
  "begins": 28,
  "open": 17,
  "Behind": 6,
  "snow": 7,
  "games": 12,
  "lovable": 3,
  "Siberian": 1,
  "huskies": 2,
  "plus": 4,
  "sheep": 1,
  "dog": 19,
  "hosts": 2,
  "parka-wrapped": 1,
  "dose": 6,
  "Everytime": 1,
  "Undercover": 7,
  "Brother": 8,
  "run": 22,
  "steam": 4,
  "finds": 21,
  "surprise": 29,
  "amuse": 6,
  "Manages": 11,
  "original": 102,
  "rips": 2,
  "many": 168,
  "ideas": 48,
  "pleasant": 21,
  "enough": 247,
  "held": 11,
  "together": 71,
  "skilled": 2,
  "ensemble": 25,
  "American": 103,
  "troubled": 3,
  "teens": 11,
  "since": 68,
  "1998": 3,
  "Whatever": 7,
  "been": 246,
  "hit-or-miss": 1,
  "when": 207,
  "bringing": 10,
  "beloved": 4,
  "books": 10,
  "screen": 111,
  "Tuck": 6,
  "Everlasting": 4,
  "both": 137,
  "animated": 31,
  "subplot": 3,
  "depicts": 3,
  "inner": 12,
  "struggles": 4,
  "adolescent": 14,
  "heroes": 7,
  "-": 159,
  "insecure": 5,
  "uncontrolled": 1,
  "intense": 16,
  "invincible": 1,
  "Werner": 2,
  "Herzog": 9,
  "alive": 19,
  "living": 21,
  "LA": 1,
  "Morton": 6,
  "actress": 19,
  "portraying": 4,
  "complex": 35,
  "character": 140,
  "Morvern": 8,
  "Callar": 5,
  "grows": 14,
  "farther": 1,
  "meanders": 3,
  "shocking": 9,
  "Son": 10,
  "Bride": 7,
  "may": 224,
  "half-hour": 4,
  "too": 392,
  "flattering": 3,
  "sense": 131,
  "mystery": 34,
  "quietness": 1,
  "simmering": 2,
  "psychological": 37,
  "drama": 176,
  "bursts": 6,
  "sudden": 6,
  "violence": 36,
  "startling": 11,
  "slow": 44,
  "buildup": 2,
  "preceded": 3,
  "taut": 8,
  "intelligent": 52,
  "truly": 44,
  "moving": 70,
  "experience": 71,
  "perfect": 41,
  "example": 15,
  "art": 61,
  "done": 63,
  "right": 92,
  "can": 329,
  "help": 34,
  "heal": 6,
  "clarify": 2,
  "comfort": 11,
  "delicately": 8,
  "deeply": 43,
  "felt": 27,
  "masterfully": 7,
  "stylized": 10,
  "triumph": 21,
  "maverick": 2,
  "director": 195,
  "deftly": 17,
  "wrought": 2,
  "suspense": 44,
  "whose": 68,
  "richer": 9,
  "shadings": 1,
  "coloring": 1,
  "rather": 101,
  "substance": 22,
  "appearance": 4,
  "Treebeard": 1,
  "Gollum": 2,
  "expanded": 3,
  "role": 40,
  "either": 50,
  "loving": 10,
  "'re": 172,
  "rolling": 6,
  "your": 246,
  "eyes": 30,
  "loved": 15,
  "!": 112,
  "incredible": 6,
  "were": 107,
  "page-turner": 2,
  "ca": 116,
  "wait": 14,
  "see": 161,
  "happens": 23,
  "next": 44,
  "Haneke": 7,
  "challenges": 9,
  "confront": 3,
  "reality": 45,
  "sexual": 26,
  "aberration": 1,
  "Absorbing": 1,
  "perhaps": 24,
  "originally": 1,
  "intended": 17,
  "clarity": 12,
  "gone": 31,
  "year": 99,
  "benchmark": 2,
  "against": 38,
  "other": 150,
  "Best": 14,
  "Picture": 4,
  "contenders": 2,
  "should": 182,
  "measured": 6,
  "Painful": 2,
  "watch": 88,
  "viewers": 44,
  "take": 103,
  "chance": 16,
  "rewarded": 6,
  "accomplished": 15,
  "riveting": 20,
  "performances": 173,
  "albeit": 5,
  "depressing": 20,
  "view": 24,
  "Iranian": 13,
  "rural": 4,
  "life": 204,
  "close": 36,
  "Iraqi": 2,
  "artsy": 6,
  "flourishes": 5,
  "aside": 15,
  "Narc": 10,
  "gritty": 13,
  "gets": 92,
  "these": 101,
  "Isle": 3,
  "preposterous": 11,
  "thoroughly": 30,
  "misogynistic": 2,
  "vistas": 4,
  "incredibly": 14,
  "beautiful": 46,
  "look": 170,
  "Together": 3,
  "Tok": 1,
  "O": 5,
  "orchestrate": 1,
  "buoyant": 9,
  "dance": 12,
  "death": 31,
  "process": 28,
  "demonstrate": 7,
  "still": 163,
  "lot": 103,
  "Hong": 10,
  "Kong": 10,
  "Director": 42,
  "Kapur": 9,
  "flair": 14,
  "landscapes": 5,
  "adventure": 41,
  "English-language": 4,
  "overpraised": 1,
  "Elizabeth": 7,
  "blast": 8,
  "educational": 6,
  "energy": 44,
  "bouncy": 4,
  "animation": 37,
  "catchy": 1,
  "songs": 15,
  "escort": 3,
  "entire": 31,
  "85": 2,
  "sports": 18,
  "action": 155,
  "exciting": 24,
  "field": 5,
  "care": 62,
  "Doug": 3,
  "Liman": 4,
  "Bourne": 9,
  "directs": 11,
  "traffic": 3,
  "wintry": 2,
  "locations": 8,
  "absorbs": 2,
  "spycraft": 1,
  "uses": 32,
  "Damon": 4,
  "ability": 24,
  "focused": 8,
  "sincere": 25,
  "piece": 81,
  "intact": 3,
  "Katz": 2,
  "archival": 5,
  "footage": 18,
  "horrifying": 9,
  "documents": 3,
  "lynchings": 1,
  "photographs": 2,
  "charming": 53,
  "reel-to-reel": 1,
  "recordings": 1,
  "Meeropol": 1,
  "entertaining": 112,
  "children": 59,
  "create": 22,
  "song": 12,
  "history": 69,
  "powerful": 47,
  "anthropologically": 1,
  "detailed": 13,
  "realization": 4,
  "early": 14,
  "'80s": 3,
  "suburbia": 1,
  "significant": 10,
  "without": 143,
  "overstated": 3,
  "McFarlane": 2,
  "lifts": 5,
  "firmly": 6,
  "above": 40,
  "level": 52,
  "coming-of-age": 36,
  "films": 169,
  "jarring": 4,
  "hard": 106,
  "back": 90,
  "boys": 12,
  "nothing": 138,
  "introduces": 5,
  "promising": 18,
  "unusual": 18,
  "kind": 139,
  "horror": 56,
  "normal": 3,
  "bromides": 2,
  "barely": 30,
  "sustain": 28,
  "interstitial": 1,
  "program": 6,
  "Discovery": 2,
  "Channel": 3,
  "Writer-director": 8,
  "Burger": 5,
  "imaginatively": 3,
  "fans": 67,
  "embers": 1,
  "dormant": 1,
  "national": 8,
  "grief": 20,
  "curiosity": 11,
  "calcified": 1,
  "chronic": 1,
  "cynicism": 8,
  "fear": 14,
  "roller-coaster": 3,
  "enjoyed": 15,
  "Time": 37,
  "Favor": 5,
  "while": 107,
  "was": 223,
  "surprised": 6,
  "quickly": 25,
  "faded": 3,
  "my": 74,
  "memory": 28,
  "Chicago": 9,
  "sophisticated": 21,
  "brash": 3,
  "sardonic": 6,
  "completely": 47,
  "joyful": 4,
  "execution": 27,
  "Steve": 7,
  "Irwin": 8,
  "method": 3,
  "Ernest": 2,
  "Hemmingway": 1,
  "accelerated": 1,
  "speed": 2,
  "volume": 3,
  "refreshing": 22,
  "Korean": 8,
  "five": 20,
  "female": 27,
  "high": 55,
  "school": 28,
  "friends": 15,
  "face": 50,
  "uphill": 2,
  "battle": 20,
  "try": 24,
  "relationships": 23,
  "deeper": 17,
  "waters": 4,
  "On": 23,
  "surface": 16,
  "lovers-on-the-run": 1,
  "crime": 36,
  "flick": 66,
  "common": 14,
  "Piesiewicz": 1,
  "Kieslowski": 3,
  "Double": 1,
  "Life": 14,
  "Veronique": 1,
  "values": 16,
  "Enterprise": 1,
  "crew": 6,
  "previous": 25,
  "adventures": 3,
  "perils": 2,
  "again-courage": 1,
  "self-sacrifice": 2,
  "patience": 13,
  "under": 50,
  "pressure": 2,
  "possible": 34,
  "sequel": 38,
  "outshine": 3,
  "then": 96,
  "SL2": 1,
  "just": 371,
  "comedy": 339,
  "operates": 4,
  "rules": 5,
  "own": 173,
  "self-contained": 1,
  "universe": 4,
  "4": 4,
  "2": 25,
  "couples": 3,
  "2000": 4,
  "miles": 2,
  "Pabst": 1,
  "Blue": 17,
  "Ribbon": 1,
  "beer": 2,
  "drink": 6,
  "ultimate": 18,
  "redneck": 2,
  "road-trip": 5,
  "filled": 23,
  "pure": 28,
  "wonderment": 2,
  "excitement": 19,
  "not": 710,
  "seen": 108,
  "du": 1,
  "sarcasm": 1,
  "tempting": 5,
  "regard": 5,
  "Mr.": 63,
  "Andrew": 4,
  "collaborators": 3,
  "oddballs": 2,
  "Earnhart": 3,
  "quizzical": 1,
  "allows": 18,
  "finally": 33,
  "artists": 10,
  "feel-good": 13,
  "term": 7,
  "Edited": 1,
  "shot": 46,
  "syncopated": 1,
  "style": 70,
  "mimicking": 1,
  "subjects": 16,
  "Pray": 5,
  "idea": 59,
  "head": 38,
  "rousing": 8,
  "invigorating": 4,
  "lacking": 23,
  "MTV": 6,
  "puffery": 2,
  "mostly": 40,
  "engrossing": 31,
  "psychologically": 5,
  "resonant": 12,
  "suspenser": 2,
  "memory-as-identity": 1,
  "obviation": 1,
  "Secret": 9,
  "intermittent": 4,
  "unease": 3,
  "reaffirming": 2,
  "long-held": 1,
  "illusions": 1,
  "indeed": 21,
  "erasing": 1,
  "recasts": 1,
  "self": 3,
  "Hip-hop": 3,
  "metaphor": 11,
  "scope": 8,
  "ambition": 9,
  "accomplishment": 3,
  "Children": 6,
  "Century": 6,
  "takes": 88,
  "Kurys": 4,
  "whole": 74,
  "dramatic": 46,
  "gut-wrenching": 4,
  "impact": 26,
  "Holocaust": 8,
  "mainly": 12,
  "told": 33,
  "Between": 4,
  "Cube": 7,
  "?": 217,
  "s": 2,
  "personal": 33,
  "revelations": 6,
  "regarding": 5,
  "shop": 3,
  "big": 118,
  "iconic": 2,
  "characters": 303,
  "gambol": 1,
  "fluidly": 1,
  "results": 17,
  "gentle": 30,
  "compassionate": 2,
  "healing": 3,
  "Somewhere": 3,
  "short": 58,
  "Tremors": 3,
  "modern": 48,
  "B-scene": 1,
  "neither": 43,
  "nor": 40,
  "agreeably": 2,
  "unpretentious": 4,
  "spend": 13,
  "ninety": 3,
  "Digital-video": 1,
  "stand-up": 12,
  "comedians": 1,
  "very": 235,
  "world": 112,
  "Unlike": 8,
  "teen": 29,
  "flicks": 21,
  "Swimming": 4,
  "time": 284,
  "tell": 36,
  "casts": 4,
  "little-known": 3,
  "performers": 17,
  "key": 11,
  "roles": 14,
  "intriguing": 43,
  "ambiguity": 6,
  "enthralling": 7,
  "playful": 13,
  "constantly": 10,
  "frustrates": 2,
  "desire": 16,
  "truth": 30,
  "man": 96,
  "deconstructing": 1,
  "format": 10,
  "biography": 5,
  "manner": 19,
  "Derrida": 8,
  "doubtless": 2,
  "blessing": 1,
  "obviously": 20,
  "struck": 4,
  "responsive": 1,
  "chord": 5,
  "South": 12,
  "Koreans": 1,
  "magic": 27,
  "parts": 19,
  "Run": 6,
  "walk": 11,
  "barbed": 2,
  "bracing": 5,
  "classy": 4,
  "item": 2,
  "legend": 4,
  "left": 45,
  "prove": 15,
  "chops": 4,
  "drive": 10,
  "show": 68,
  "nature": 29,
  "progress": 2,
  "Fessenden": 5,
  "trilogy": 4,
  "theme": 16,
  "proved": 4,
  "important": 26,
  "him": 63,
  "especially": 53,
  "finale": 10,
  "exactly": 38,
  "gourmet": 2,
  "meal": 6,
  "fair": 14,
  "coming": 27,
  "drive-thru": 1,
  "IMAX": 16,
  "Strap": 1,
  "pair": 8,
  "3-D": 2,
  "goggles": 2,
  "shut": 4,
  "vicarious": 2,
  "voyage": 2,
  "last": 67,
  "frontier": 1,
  "space": 15,
  "Merely": 1,
  "technical": 13,
  "logistical": 1,
  "feat": 6,
  "Russian": 10,
  "Ark": 3,
  "marks": 15,
  "cinematic": 76,
  "milestone": 1,
  "Schweiger": 1,
  "talented": 25,
  "terribly": 10,
  "charismatic": 9,
  "qualities": 7,
  "essential": 5,
  "stars": 21,
  "social": 38,
  "anarchists": 2,
  "deal": 23,
  "sizzle": 4,
  "steak": 1,
  "spectacular": 17,
  "incarnation": 3,
  "fizz": 5,
  "infectious": 6,
  "gem": 16,
  "obsession": 10,
  "delight": 17,
  "newcomers": 3,
  "bygone": 3,
  "Gloriously": 2,
  "goofy": 20,
  "gory": 10,
  "midnight": 4,
  "stuff": 48,
  "overcomes": 5,
  "regular": 1,
  "minefield": 1,
  "cliches": 37,
  "potent": 9,
  "doses": 7,
  "honesty": 12,
  "sensitivity": 5,
  "senses": 7,
  "dulled": 2,
  "slasher": 10,
  "gorefests": 1,
  "connoisseur": 1,
  "ticket": 9,
  "minor": 18,
  "tries": 41,
  "balance": 17,
  "sweetness": 7,
  "coarseness": 2,
  "paints": 6,
  "sad": 41,
  "singles": 5,
  "scene": 40,
  "intensely": 4,
  "unlike": 11,
  "Quills": 2,
  "shows": 43,
  "temper": 2,
  "As": 130,
  "lo-fi": 1,
  "special": 75,
  "effects": 60,
  "folks": 16,
  "cobbled": 6,
  "Nemesis": 6,
  "indulge": 1,
  "force": 26,
  "humanity": 19,
  "over": 136,
  "hardware": 2,
  "George": 24,
  "Lucas": 7,
  "forgotten": 12,
  "Mike": 13,
  "win": 17,
  "originality": 20,
  "succeed": 9,
  "following": 12,
  "formula": 38,
  "winning": 23,
  "offering": 18,
  "audience": 137,
  "urban": 22,
  "welcome": 26,
  "models": 2,
  "optimism": 4,
  "hoot": 7,
  "half": 48,
  "candidate": 3,
  "giving": 24,
  "same": 96,
  "15-cent": 1,
  "stump": 1,
  "speech": 2,
  "Far": 12,
  "innocent": 7,
  "well-meaning": 8,
  "superior": 13,
  "human": 88,
  "played": 21,
  "roads": 3,
  "Waydowntown": 1,
  "boasts": 6,
  "huge": 19,
  "charm": 64,
  "factor": 8,
  "smacks": 6,
  "Tim": 4,
  "Allen": 22,
  "hogs": 1,
  "scenes": 90,
  "fellow": 7,
  "plenty": 28,
  "laughs": 72,
  "lines": 18,
  "More": 30,
  "load": 5,
  "enjoyable": 60,
  "Conan-esque": 1,
  "claptrap": 3,
  "punishing": 2,
  "special-effects": 3,
  "soul": 19,
  "assaults": 2,
  "Mummy": 4,
  "pictures": 28,
  "represent": 2,
  "Enormously": 3,
  "likable": 11,
  "partly": 7,
  "aware": 8,
  "grasp": 7,
  "absurd": 11,
  "Here": 14,
  "British": 19,
  "gleefully": 3,
  "unconcerned": 2,
  "plausibility": 2,
  "determined": 13,
  "entertain": 12,
  "lively": 13,
  "script": 130,
  "sharp": 30,
  "acting": 102,
  "partially": 1,
  "interludes": 3,
  "Just": 49,
  "Kiss": 10,
  "seem": 80,
  "minty": 1,
  "Must": 1,
  "believed": 4,
  "Ray": 3,
  "Liotta": 4,
  "Jason": 16,
  "Patric": 2,
  "underwritten": 3,
  "fooled": 2,
  "Nobody": 2,
  "deserves": 24,
  "prizes": 1,
  "here": 132,
  "Everything": 15,
  "Yvan": 4,
  "Charlotte": 4,
  "rambunctious": 1,
  "Jewish": 7,
  "sister": 4,
  "non-Jew": 1,
  "husband": 9,
  "feels": 112,
  "happiest": 1,
  "deals": 5,
  "subject": 77,
  "surprising": 32,
  "Fans": 9,
  "Behan": 7,
  "Irish": 10,
  "general": 17,
  "Borstal": 4,
  "Boy": 12,
  "Its": 41,
  "transparently": 3,
  "obvious": 43,
  "slowly": 12,
  "paced": 17,
  "thriller": 120,
  "faithful": 12,
  "presumes": 2,
  "twin": 2,
  "premises": 2,
  "become": 51,
  "backs": 1,
  "parents": 29,
  "age": 21,
  "fleeting": 6,
  "precious": 14,
  "commodity": 1,
  "matter": 60,
  "Stephen": 8,
  "homespun": 1,
  "Mule": 1,
  "Skinner": 1,
  "Blues": 1,
  "posse": 1,
  "trailer": 5,
  "park": 6,
  "denizens": 3,
  "solidly": 6,
  "seaworthy": 1,
  "chiller": 7,
  "past": 45,
  "fantastical": 2,
  "aspects": 14,
  "harsh": 7,
  "realities": 3,
  "``": 620,
  "'ll": 116,
  "sock-you-in-the-eye": 1,
  "visual": 64,
  "tour-de-force": 2,
  "likely": 52,
  "anywhere": 10,
  "There": 209,
  "misses": 9,
  "hits": 18,
  "ultimately": 93,
  "humor": 134,
  "foibles": 6,
  "behavior": 17,
  "return": 10,
  "roots": 10,
  "genre": 59,
  "depend": 5,
  "well-made": 14,
  "certain": 25,
  "intelligence": 36,
  "non-reactionary": 1,
  "morality": 10,
  "science": 11,
  "count": 9,
  "unforgettable": 7,
  "Remains": 1,
  "solid": 52,
  "somewhat": 28,
  "heavy-handed": 19,
  "account": 12,
  "near-disaster": 1,
  "up": 359,
  "Howard": 10,
  "steady": 5,
  "imaginative": 17,
  "hand": 25,
  "Makmalbaf": 1,
  "follows": 9,
  "resolutely": 8,
  "realistic": 18,
  "path": 11,
  "uncompromising": 10,
  "existence": 10,
  "Kurdish": 1,
  "refugees": 6,
  "Iran": 5,
  "borderlands": 1,
  "For": 90,
  "chunk": 1,
  "running": 31,
  "Trapped": 5,
  "claustrophobic": 8,
  "Most": 18,
  "captivating": 12,
  "pinch": 1,
  "tartness": 1,
  "Nair": 9,
  "capture": 13,
  "complexity": 14,
  "family": 101,
  "trials": 1,
  "tribulations": 1,
  "seaside": 2,
  "splendor": 3,
  "shallow": 15,
  "going": 78,
  "Rare": 4,
  "attempts": 23,
  "disarming": 4,
  "indie": 16,
  "Ranks": 1,
  "among": 27,
  "Willams": 1,
  "Engagingly": 1,
  "maddening": 3,
  "magnetic": 2,
  "ebb": 1,
  "flow": 7,
  "friendship": 23,
  "buried": 6,
  "environment": 5,
  "traditional": 10,
  "moviemaking": 16,
  "careful": 8,
  "period": 30,
  "wit": 53,
  "Maybe": 11,
  "release": 17,
  "worst": 53,
  "comedies": 31,
  "decades": 18,
  "honestly": 10,
  "Analyze": 10,
  "That": 45,
  "bad": 206,
  "droll": 8,
  "well-acted": 20,
  "character-driven": 3,
  "unexpected": 22,
  "deposits": 1,
  "feeling": 56,
  "simply": 64,
  "Watching": 24,
  "aptly": 2,
  "challenge": 4,
  "punishment": 4,
  "Huppert": 10,
  "tearing": 2,
  "landmark": 6,
  "cop": 9,
  "understands": 11,
  "medium": 6,
  "amazingly": 6,
  "Britney": 11,
  "delivered": 15,
  "safe": 5,
  "20-year-old": 1,
  "superstar": 4,
  "girls": 14,
  "travel": 9,
  "fame": 5,
  "freeway": 2,
  "Those": 21,
  "outside": 9,
  "business": 21,
  "enjoy": 56,
  "nervous": 5,
  "mild": 13,
  "headache": 2,
  "exhilarate": 1,
  "Beanie": 1,
  "gang": 6,
  "put": 51,
  "video": 64,
  "spare": 11,
  "borrowed": 3,
  "materials": 2,
  "must": 42,
  "understand": 19,
  "'m": 48,
  "sure": 42,
  "Miyazaki": 5,
  "himself": 46,
  "certainly": 46,
  "fascinated": 3,
  "undoubtedly": 5,
  "delighted": 3,
  "Tadpole": 7,
  "good-natured": 8,
  "treat": 24,
  "slight": 23,
  "pleasure": 39,
  "insightful": 19,
  "Oscar-nominated": 2,
  "sides": 13,
  "ever-escalating": 1,
  "conflict": 20,
  "say": 79,
  "watchful": 2,
  "parental": 3,
  "peace": 5,
  "another": 128,
  "admired": 2,
  "Whether": 14,
  "moved": 7,
  "bored": 13,
  "frustrated": 3,
  "moments": 108,
  "heartbreaking": 11,
  "keep": 76,
  "glued": 2,
  "goodness": 4,
  "Queen": 15,
  "Latifah": 1,
  "offer": 29,
  "she": 60,
  "problem": 51,
  "flaunting": 1,
  "natural": 18,
  "gifts": 5,
  "She": 12,
  "sweet": 54,
  "Without": 11,
  "heavy-handedness": 2,
  "Dong": 10,
  "perspective": 16,
  "contradictions": 1,
  "Solid": 1,
  "lump-in-the-throat": 1,
  "derives": 3,
  "power": 58,
  "sticking": 5,
  "facts": 3,
  "keeps": 36,
  "diverted": 1,
  "lightens": 1,
  "wallet": 5,
  "leaving": 13,
  "sting": 5,
  "interesting": 110,
  "Goodall": 2,
  "chimpanzees": 1,
  "bigger-than-life": 1,
  "wo": 57,
  "bust": 2,
  "gut": 2,
  "merely": 30,
  "blandly": 2,
  "surgical": 2,
  "examination": 27,
  "joke": 23,
  "crudely": 2,
  "constructed": 17,
  "gripping": 23,
  "questing": 1,
  "person": 22,
  "racked": 1,
  "self-loathing": 2,
  "becomes": 53,
  "enemy": 3,
  "race": 9,
  "extends": 3,
  "writings": 2,
  "Jean": 5,
  "Genet": 1,
  "John": 55,
  "Rechy": 1,
  "Fassbinder": 1,
  "nocturnal": 1,
  "Goya": 1,
  "wears": 13,
  "B-movie": 14,
  "heritage": 4,
  "badge": 1,
  "honor": 5,
  "striking": 16,
  "realizes": 3,
  "before": 98,
  "fully": 25,
  "permutations": 1,
  "involved": 23,
  "Drumline": 5,
  "admirable": 10,
  "plays": 48,
  "clashes": 2,
  "between": 133,
  "brothers": 6,
  "unabashedly": 8,
  "schmaltzy": 5,
  "painful": 21,
  "incident": 6,
  "headlines": 1,
  "1995": 3,
  "Tsai": 10,
  "Ming-liang": 4,
  "taken": 21,
  "trademark": 7,
  "refined": 3,
  "crystalline": 1,
  "point": 76,
  "Purely": 1,
  "propaganda": 8,
  "unabashed": 2,
  "hero": 35,
  "worship": 3,
  "nonetheless": 9,
  "inadvertently": 3,
  "timely": 12,
  "invaluable": 5,
  "implicit": 3,
  "reminder": 7,
  "U.S.": 7,
  "foreign": 13,
  "policy": 3,
  "rise": 8,
  "Castro": 7,
  "Now": 8,
  "trimmed": 2,
  "20": 14,
  "lavish": 5,
  "three-year-old": 1,
  "production": 45,
  "scale": 9,
  "satisfy": 8,
  "grown-up": 4,
  "escapism": 9,
  "We": 40,
  "studies": 2,
  "cross-section": 2,
  "Americana": 2,
  "Hollywood": 113,
  "could": 203,
  "possibly": 17,
  "fictionalize": 1,
  "clumsy": 14,
  "ambitions": 6,
  "equally": 20,
  "admirably": 5,
  "uncommercial": 2,
  "Daring": 2,
  "mesmerizing": 18,
  "exceedingly": 6,
  "forget": 17,
  "Moore": 16,
  "impresses": 1,
  "Haynes": 8,
  "Safe": 6,
  "Visits": 1,
  "spy-movie": 2,
  "territory": 14,
  "examines": 6,
  "footnote": 4,
  "seldom": 3,
  "brought": 13,
  "light": 39,
  "guessing": 9,
  "first": 133,
  "frame": 20,
  "absorbing": 19,
  "slice-of-depression": 1,
  "touches": 11,
  "nerves": 4,
  "rings": 5,
  "Parker": 20,
  "brilliantly": 9,
  "updated": 3,
  "source": 14,
  "grasped": 1,
  "essence": 8,
  "composing": 1,
  "sorrowful": 2,
  "hilarious": 36,
  "tone": 48,
  "poem": 10,
  "alienated": 2,
  "labor": 3,
  "absurdist": 7,
  "workplace": 3,
  "sitcom": 14,
  "result": 33,
  "quite": 111,
  "delightful": 27,
  "All": 67,
  "persnickety": 1,
  "preteens": 1,
  "nonthreatening": 2,
  "thrilling": 12,
  "Despite": 59,
  "infuriating": 5,
  "flaws": 27,
  "least": 79,
  "Amy": 7,
  "personality": 13,
  "Polanski": 14,
  "Day": 20,
  "typical": 19,
  "knock-offs": 1,
  "Polished": 2,
  "political-action": 1,
  "epics": 4,
  "Is": 40,
  "Elling": 5,
  "portrayed": 3,
  "quiet": 25,
  "fastidiousness": 1,
  "Per": 1,
  "Christian": 9,
  "Ellefsen": 1,
  "singular": 4,
  "frailties": 1,
  "only": 289,
  "slightly": 24,
  "magnified": 1,
  "versions": 6,
  "ones": 22,
  "vex": 1,
  "nearly": 62,
  "Denis": 5,
  "co-writer": 7,
  "Michele": 4,
  "Petin": 1,
  "impeccable": 8,
  "penetrates": 1,
  "rawness": 2,
  "unflinching": 9,
  "tantalizing": 1,
  "Lead": 1,
  "provocatuers": 1,
  "Testud": 3,
  "Parmentier": 2,
  "superlative": 2,
  "trip": 18,
  "minds": 7,
  "motivations": 4,
  "stress": 1,
  "keen": 2,
  "unsentimental": 8,
  "variations": 3,
  "motherhood": 3,
  "particularly": 40,
  "downer": 6,
  "passions": 4,
  "aroused": 1,
  "discord": 3,
  "cultures": 10,
  "set": 59,
  "strange": 23,
  "stark": 5,
  "Mideast": 1,
  "desert": 3,
  "lovingly": 4,
  "perceptively": 1,
  "filmed": 17,
  "taste": 33,
  "desiccated": 3,
  "Remarkably": 1,
  "accessible": 17,
  "affecting": 19,
  "Never": 18,
  "whether": 33,
  "buy": 12,
  "Barris": 2,
  "CIA": 5,
  "hit": 30,
  "kooky": 3,
  "shadowy": 4,
  "vision": 30,
  "Clooney": 9,
  "sustains": 7,
  "throughout": 27,
  "daring": 15,
  "inventive": 23,
  "impressive": 31,
  "direction": 69,
  "narrative": 57,
  "knew": 7,
  "spin": 7,
  "appreciate": 13,
  "attempt": 39,
  "His": 16,
  "intimate": 22,
  "dialogue": 94,
  "greatly": 4,
  "Silberstein": 1,
  "large": 16,
  "grow": 10,
  "attached": 3,
  "full": 80,
  "strength": 17,
  "warmth": 18,
  "vitality": 8,
  "believe": 44,
  "immensely": 5,
  "David": 32,
  "Goliath": 2,
  "playing": 26,
  "additional": 1,
  "storyline": 13,
  "magical": 6,
  "Mama": 3,
  "bit": 71,
  "find": 99,
  "third-act": 2,
  "plot": 172,
  "development": 17,
  "ribald": 2,
  "touching": 44,
  "nostalgia": 12,
  "please": 17,
  "search": 14,
  "Jules": 2,
  "Jim": 6,
  "millennium": 2,
  "You": 121,
  "definitely": 25,
  "T-shirt": 2,
  "Provides": 5,
  "window": 9,
  "imagination": 33,
  "hermetic": 2,
  "analysis": 2,
  "Todd": 8,
  "Solondz": 18,
  "Windtalkers": 11,
  "shapelessly": 1,
  "gratifying": 1,
  "invites": 3,
  "pick": 9,
  "apart": 21,
  "faults": 3,
  "admit": 10,
  "where": 99,
  "live": 31,
  "Presents": 4,
  "astute": 4,
  "appraisal": 1,
  "Middle": 6,
  "musical": 16,
  "torpor": 3,
  "desperate": 14,
  "struggle": 16,
  "escape": 12,
  "anyway": 9,
  "faces": 9,
  "difficult": 39,
  "issues": 23,
  "decade": 7,
  "Benefits": 1,
  "Zhao": 4,
  "Jie": 3,
  "remember": 13,
  "end": 110,
  "brimming": 4,
  "detail": 18,
  "nuance": 7,
  "speaks": 9,
  "volumes": 3,
  "spirit": 36,
  "solace": 3,
  "events": 29,
  "easily": 39,
  "crush": 3,
  "forever": 5,
  "Steven": 23,
  "Shainberg": 5,
  "succeeded": 3,
  "focusing": 4,
  "intently": 1,
  "quirky": 50,
  "individuals": 6,
  "figures": 7,
  "stands": 14,
  "forth": 7,
  "chronicle": 6,
  "abuses": 2,
  "Latin": 5,
  "America": 28,
  "oppressive": 4,
  "regimes": 1,
  "soft": 8,
  "percolating": 2,
  "deadpan": 9,
  "lovely": 21,
  "depiction": 14,
  "Using": 3,
  "figurative": 1,
  "port-of-call": 1,
  "even-handed": 1,
  "ideological": 2,
  "ship": 5,
  "dock": 1,
  "unloading": 1,
  "continues": 9,
  "longer": 18,
  "journey": 42,
  "ahead": 8,
  "generation": 15,
  "defines": 6,
  "Transporter": 5,
  "unapologetically": 2,
  "dumb": 43,
  "witness": 7,
  "several": 28,
  "Greek-American": 1,
  "weddings": 1,
  "happily": 5,
  "victim": 7,
  "none": 24,
  "testify": 1,
  "comparative": 1,
  "accuracy": 3,
  "Vardalos": 4,
  "memories": 10,
  "insights": 10,
  "Has": 34,
  "Williams": 26,
  "inhabited": 1,
  "now": 50,
  "By": 33,
  "presenting": 1,
  "impossible": 38,
  "romance": 53,
  "Pumpkin": 10,
  "dares": 5,
  "forces": 10,
  "debut": 52,
  "first-time": 11,
  "writer-director": 21,
  "Romanek": 6,
  "considering": 9,
  "background": 10,
  "notch": 4,
  "once": 75,
  "accents": 6,
  "Nothing": 32,
  "emotional": 87,
  "positive": 7,
  "wrench": 2,
  "sit": 29,
  "successes": 3,
  "tempered": 2,
  "elements": 34,
  "direct": 6,
  "antithesis": 1,
  "thought-provoking": 18,
  "dazzlingly": 1,
  "self-assured": 2,
  "directorial": 16,
  "praise": 3,
  "holds": 19,
  "Wilde": 11,
  "absolutely": 21,
  "meaning": 16,
  "anything": 76,
  "polished": 11,
  "cleverness": 8,
  "Thankfully": 1,
  "skirts": 2,
  "rapidly": 4,
  "deteriorating": 1,
  "line": 41,
  "fantasy": 28,
  "tongue-in-cheek": 4,
  "attitude": 9,
  "pushes": 7,
  "Croc": 1,
  "Hunter": 7,
  "agenda": 3,
  "message": 50,
  "Trouble": 12,
  "Every": 29,
  "seems": 117,
  "disrupts": 1,
  "stasis": 3,
  "me": 91,
  "sucker": 4,
  "fashion": 17,
  "shamelessly": 5,
  "loves": 10,
  "eat": 7,
  "Mostly": 12,
  "ingredients": 11,
  "appetite": 5,
  "re-enactments": 1,
  "talking-head": 2,
  "interviews": 5,
  "sublime": 4,
  "stabs": 2,
  "occasionally": 37,
  "cloying": 12,
  "specialty": 2,
  "wonderful": 29,
  "character-based": 1,
  "hear": 9,
  "side": 28,
  "Talk": 5,
  "Her": 12,
  "women": 62,
  "endearingly": 1,
  "offbeat": 10,
  "meet-cute": 2,
  "gimmick": 6,
  "tug-of-war": 2,
  "viewer": 35,
  "expectations": 12,
  "undeniable": 9,
  "old-time": 2,
  "messy": 8,
  "Big": 32,
  "Fat": 15,
  "Greek": 14,
  "Wedding": 16,
  "sacrifice": 5,
  "stirring": 13,
  "epilogue": 1,
  "post-Soviet": 1,
  "Russia": 1,
  "Who": 15,
  "knows": 28,
  "Godard": 13,
  "words": 26,
  "images": 40,
  "add": 30,
  "mesmerize": 2,
  "balanced": 6,
  "reflective": 5,
  "reasonable": 3,
  "principals": 2,
  "fine": 49,
  "Bishop": 1,
  "standouts": 1,
  "change": 28,
  "necessary": 16,
  "discussion": 5,
  "politics": 18,
  "understandable": 2,
  "looking": 49,
  "energetic": 20,
  "largely": 22,
  "celebratory": 4,
  "isolation": 6,
  "permeates": 4,
  "bastions": 1,
  "individuality": 2,
  "Ikea": 1,
  "troopers": 1,
  "gross": 5,
  "outs": 2,
  "bawdy": 2,
  "Somewhat": 1,
  "blurred": 1,
  "Kinnear": 7,
  "razor": 1,
  "Ratliff": 4,
  "wisely": 3,
  "rejects": 2,
  "temptation": 3,
  "remembers": 2,
  "'60s": 9,
  "interested": 21,
  "response": 4,
  "stroke": 5,
  "Ram": 6,
  "Dass": 6,
  "Fierce": 5,
  "Grace": 5,
  "seeking": 7,
  "Intriguing": 4,
  "read": 20,
  "disappointed": 10,
  "New": 56,
  "Guy": 12,
  "brain": 18,
  "savvy": 7,
  "exploration": 17,
  "paranoia": 6,
  "insecurity": 3,
  "Legendary": 1,
  "writer": 22,
  "Brendan": 4,
  "memoir": 4,
  "given": 35,
  "transferral": 1,
  "asset": 3,
  "connect-the-dots": 3,
  "spy-on-the-run": 1,
  "caper": 12,
  "twists": 22,
  "worthy": 29,
  "Mamet": 7,
  "enormous": 7,
  "thinking": 23,
  "audiences": 36,
  "saddest": 2,
  "manages": 57,
  "uplifting": 9,
  "sentimental": 26,
  "usual": 29,
  "brilliant": 35,
  "Even": 68,
  "rough": 7,
  "safely": 2,
  "sanded": 1,
  "Insomnia": 7,
  "pretty": 72,
  "darned": 4,
  "precisely": 7,
  "Soderbergh": 19,
  "Full": 30,
  "Frontal": 12,
  "did": 79,
  "stop": 9,
  "enjoying": 5,
  "tug": 5,
  "war": 37,
  "ensues": 4,
  "snapshot": 5,
  "China": 7,
  "microcosm": 1,
  "crash": 4,
  "course": 22,
  "mythology": 3,
  "Nearly": 3,
  "surreal": 14,
  "dabbling": 1,
  "French": 46,
  "simple": 38,
  "taking": 28,
  "risk": 4,
  "choose": 8,
  "ways": 37,
  "thing": 110,
  "Alias": 2,
  "Betty": 5,
  "predictable": 65,
  "Asia": 2,
  "authors": 1,
  "herself": 7,
  "Anna": 3,
  "Battista": 1,
  "Italian": 14,
  "aspiring": 2,
  "directress": 1,
  "Roman": 8,
  "Coppola": 6,
  "Dad": 3,
  "heck": 3,
  "filmmakers": 59,
  "based": 22,
  "CQ": 4,
  "keeping": 9,
  "project": 38,
  "breezily": 1,
  "apolitical": 1,
  "campaign": 3,
  "trail": 2,
  "High": 16,
  "melodrama": 43,
  "emotionally": 29,
  "thanks": 23,
  "credible": 9,
  "Finally": 3,
  "delivers": 43,
  "couple": 21,
  "genres": 10,
  "enlightening": 5,
  "visit": 7,
  "able": 27,
  "theater": 51,
  "Spielberg": 25,
  "invite": 2,
  "gawk": 1,
  "applaud": 3,
  "He": 34,
  "wants": 24,
  "part": 77,
  "wallpaper": 1,
  "chosen": 7,
  "thankfully": 5,
  "Hu": 1,
  "Liu": 3,
  "matter-of-fact": 1,
  "glint": 1,
  "sorrow": 3,
  "longing": 7,
  "bold": 12,
  "lyrical": 12,
  "feature": 56,
  "Raja": 1,
  "Amari": 3,
  "expands": 3,
  "pat": 11,
  "notion": 14,
  "middle-aged": 8,
  "wan": 4,
  "na": 4,
  "treatise": 2,
  "sensual": 8,
  "empowerment": 5,
  "Easier": 1,
  "respect": 14,
  "enthuse": 1,
  "Andersson": 2,
  "rigorous": 1,
  "distanced": 3,
  "distancing": 1,
  "Girls": 9,
  "wild": 17,
  "civil": 3,
  "again": 73,
  "Tunney": 4,
  "allowed": 6,
  "build": 9,
  "uncommonly": 5,
  "real-live": 1,
  "girl": 23,
  "complete": 18,
  "trouble": 12,
  "hope": 30,
  "satisfying": 42,
  "Think": 3,
  "sort": 55,
  "food": 9,
  "Clever": 3,
  "brutal": 13,
  "strangely": 20,
  "soulful": 6,
  "remains": 40,
  "movingly": 1,
  "fiction": 18,
  "learning": 4,
  "cultural": 24,
  "clash": 5,
  "Will": 15,
  "grab": 8,
  "amaze": 2,
  "remarkable": 26,
  "179-minute": 1,
  "meditation": 21,
  "revolution": 7,
  "follow": 15,
  "creepy": 28,
  "explorations": 2,
  "committed": 11,
  "Magimel": 2,
  "involving": 22,
  "Chinese": 16,
  "actor": 48,
  "winds": 11,
  "institution": 3,
  "acted": 34,
  "actual": 10,
  "Hands": 1,
  "pays": 9,
  "price": 18,
  "intricate": 9,
  "intellectual": 13,
  "gamesmanship": 3,
  "terrific": 41,
  "Dennis": 2,
  "Quaid": 5,
  "athletic": 2,
  "high-energy": 2,
  "drumming": 2,
  "marching": 5,
  "excellent": 31,
  "cares": 8,
  "weak": 20,
  "Compelling": 2,
  "revenge": 15,
  "weakened": 1,
  "miscast": 2,
  "leading": 6,
  "lady": 5,
  "perceptive": 5,
  "subtle": 28,
  "supportive": 1,
  "Marks": 1,
  "foul": 5,
  "freaky": 4,
  "Attal": 8,
  "mixes": 5,
  "serious": 41,
  "ego": 6,
  "jealousy": 11,
  "within": 18,
  "seemingly": 10,
  "serene": 2,
  "marriage": 7,
  "diversity": 3,
  "represented": 3,
  "terms": 23,
  "ethnicity": 2,
  "prevents": 5,
  "proceedings": 10,
  "repetitious": 2,
  "appropriately": 3,
  "brief": 8,
  "40-minute": 1,
  "Pianist": 9,
  "valedictory": 1,
  "experiences": 14,
  "bargain": 1,
  "Foster": 4,
  "nails": 5,
  "tight": 7,
  "illuminated": 2,
  "shards": 1,
  "pronounce": 3,
  "gyro": 1,
  "correctly": 2,
  "transcends": 10,
  "ethnic": 7,
  "boundaries": 5,
  "office": 9,
  "alienating": 3,
  "Bartleby": 9,
  "Farrell": 1,
  "successfully": 5,
  "foil": 1,
  "Willis": 6,
  "world-weary": 1,
  "colonel": 1,
  "Audiences": 4,
  "conditioned": 1,
  "getting": 38,
  "weepy": 4,
  "saucer-eyed": 1,
  "downy-cheeked": 1,
  "moppets": 1,
  "empathetic": 1,
  "caretakers": 2,
  "probably": 61,
  "cheated": 4,
  "tart": 4,
  "sugar-free": 1,
  "Bennett": 2,
  "dramatization": 3,
  "descent": 2,
  "post-breakup": 1,
  "perdition": 1,
  "morbid": 3,
  "appeal": 33,
  "tough": 19,
  "shake": 15,
  "introduction": 5,
  "expected": 17,
  "Sayles": 7,
  "wordplay": 1,
  "contrivances": 10,
  "overshadowed": 4,
  "model": 2,
  "Weber": 2,
  "Weissman": 2,
  "verve": 9,
  "Cockettes": 3,
  "gender": 7,
  "preference": 1,
  "political": 33,
  "agitprop": 3,
  "indomitable": 1,
  "rebel": 3,
  "Yeah": 1,
  "damn": 15,
  "unbelievably": 3,
  "perfection": 5,
  "Over-the-top": 1,
  "ostentatious": 1,
  "got": 34,
  "oodles": 2,
  "poignant": 22,
  "reveals": 22,
  "writing": 37,
  "arithmetic": 2,
  "learn": 12,
  "Nicely": 2,
  "serves": 14,
  "society": 15,
  "transition": 3,
  "tender": 14,
  "African-American": 2,
  "quest": 11,
  "come": 97,
  "origins": 3,
  "yearning": 8,
  "hearts": 12,
  "acceptance": 3,
  "circle": 2,
  "Celebrated": 1,
  "Sundance": 6,
  "manners": 6,
  "glossy": 9,
  "glib": 7,
  "Renner": 5,
  "Dahmer": 9,
  "award-worthy": 1,
  "expect": 28,
  "bunch": 14,
  "particular": 16,
  "interest": 48,
  "students": 4,
  "enthusiast": 3,
  "international": 6,
  "designed": 15,
  "ages": 16,
  "backgrounds": 3,
  "rhythmic": 1,
  "Energetic": 1,
  "boldly": 4,
  "Star": 17,
  "Wars": 8,
  "major": 26,
  "album": 7,
  "miss": 18,
  "dazzles": 1,
  "AND": 1,
  "satisfies": 6,
  "lust": 4,
  "fast-paced": 5,
  "Minority": 7,
  "Report": 9,
  "transitions": 2,
  "adulthood": 1,
  "fraught": 1,
  "small": 44,
  "amount": 20,
  "poetry": 20,
  "Ca": 7,
  "Swim": 3,
  "Wannabes": 1,
  "written": 35,
  "DeMeo": 2,
  "produced": 15,
  "directed": 45,
  "Charles": 6,
  "A.": 3,
  "Addessi": 1,
  "authentic": 14,
  "Jacquot": 9,
  "Tosca": 7,
  "No": 64,
  "Such": 14,
  "Thing": 22,
  "Beatrice": 1,
  "affection": 17,
  "monster": 22,
  "liked": 21,
  "Notting": 4,
  "Hill": 11,
  "Four": 8,
  "And": 56,
  "Bridget": 3,
  "Jones": 14,
  "Diary": 3,
  "Fidelity": 2,
  "About": 35,
  "melding": 1,
  "buff": 2,
  "reflecting": 1,
  "instability": 2,
  "metaphorical": 5,
  "unnerving": 8,
  "heartbeat-like": 1,
  "score": 17,
  "whole-heartedly": 1,
  "recommend": 22,
  "historical": 28,
  "significance": 4,
  "alone": 22,
  "Hey": 13,
  "needs": 32,
  "shower": 4,
  "Longley": 2,
  "remarkably": 17,
  "coherent": 8,
  "horrifically": 1,
  "vivid": 19,
  "turbulent": 3,
  "Although": 45,
  "bangs": 2,
  "cliched": 10,
  "drum": 3,
  "crowd-pleaser": 3,
  "spunk": 2,
  "Often": 11,
  "gruelling": 1,
  "Seldahl": 6,
  "Wollter": 6,
  "sterling": 3,
  "raise": 6,
  "maudlin": 14,
  "disease": 3,
  "Go": 8,
  "stunning": 22,
  "dreamlike": 3,
  "visuals": 17,
  "impress": 2,
  "Euro-film": 1,
  "pretension": 11,
  "proves": 38,
  "Sam": 6,
  "Rockwell": 1,
  "world-class": 3,
  "Confessions": 5,
  "Dangerous": 5,
  "Mind": 2,
  "vastness": 1,
  "implied": 1,
  "Metropolis": 5,
  "breathtaking": 10,
  "Murderous": 3,
  "Maids": 3,
  "comprehensive": 2,
  "strike": 9,
  "closest": 3,
  "Dogtown": 7,
  "Z-Boys": 5,
  "aggressive": 2,
  "green-guts": 1,
  "beaut": 1,
  "deceivingly": 1,
  "retrospect": 1,
  "Ana": 5,
  "vibrant": 15,
  "individual": 6,
  "focus": 18,
  "upon": 23,
  "successful": 22,
  "slick": 13,
  "skillful": 4,
  "witty": 26,
  "humour": 10,
  "growth": 3,
  "Bubba": 2,
  "Ho-Tep": 2,
  "bravura": 3,
  "lead": 32,
  "Bruce": 8,
  "Campbell": 3,
  "deserve": 14,
  "leave": 45,
  "building": 8,
  "until": 26,
  "despite": 48,
  "slack": 5,
  "screams": 4,
  "bathroom": 2,
  "break": 14,
  "job": 34,
  "likability": 1,
  "increments": 1,
  "artfully": 7,
  "camouflaged": 1,
  "everyday": 7,
  "activities": 2,
  "tremendous": 6,
  "Brazil": 1,
  "notes": 6,
  "use": 23,
  "Hour": 8,
  "Photo": 5,
  "delusions": 3,
  "flashes": 5,
  "Kaufman": 14,
  "creates": 24,
  "eerie": 5,
  "night": 11,
  "Matthew": 9,
  "killed": 6,
  "Chalk": 2,
  "adoration": 1,
  "De": 33,
  "Niro": 21,
  "Murphy": 20,
  "myriad": 2,
  "sensibility": 7,
  "exudes": 3,
  "nostalgic": 3,
  "free": 15,
  "nonsense": 14,
  "happening": 8,
  "represents": 14,
  "better-than-average": 2,
  "movie-making": 2,
  "demand": 6,
  "distracted": 3,
  "irrevocable": 2,
  "ties": 8,
  "bind": 2,
  "enchanting": 4,
  "Potter": 8,
  "anxious": 2,
  "Hogwarts": 1,
  "Express": 1,
  "toward": 18,
  "mischief": 1,
  "talents": 15,
  "Moonlight": 7,
  "Mile": 7,
  "heart-on-its-sleeve": 1,
  "humble": 3,
  "spiced": 3,
  "wry": 14,
  "pathos": 10,
  "Morgan": 2,
  "Redgrave": 3,
  "aquatic": 1,
  "shores": 2,
  "Baja": 1,
  "California": 3,
  "peninsula": 1,
  "Mexico": 2,
  "virtues": 10,
  "Dark": 5,
  "surprisingly": 49,
  "avalanche": 2,
  "eye-popping": 3,
  "Starts": 9,
  "bang": 2,
  "fizzles": 2,
  "wet": 8,
  "stick": 7,
  "dynamite": 2,
  "open-ended": 3,
  "refuses": 7,
  "entirely": 32,
  "wounds": 3,
  "hip": 13,
  "hyper-time": 1,
  "Clockstoppers": 8,
  "relatively": 13,
  "wraps": 2,
  "elegant": 10,
  "symmetry": 3,
  "warned": 3,
  "slog": 5,
  "looks": 46,
  "having": 30,
  "slapstick": 18,
  "antics": 6,
  "silly": 64,
  "street": 8,
  "patois": 1,
  "tossing": 2,
  "obscure": 6,
  "expressions": 4,
  "Bellini": 2,
  "Mullinski": 1,
  "compact": 1,
  "86": 4,
  "breezes": 1,
  "wonder": 27,
  "ghosts": 4,
  "imagining": 1,
  "themselves": 30,
  "sly": 8,
  "wink": 2,
  "Others": 4,
  "becoming": 14,
  "postmodern": 4,
  "men": 35,
  "sardine": 1,
  "warped": 2,
  "logic": 12,
  "Long": 8,
  "after": 76,
  "Justine": 2,
  "wondering": 8,
  "happen": 16,
  "wishing": 6,
  "whatever": 13,
  "mean": 17,
  "Still": 12,
  "pretentious": 39,
  "subtext": 4,
  "value": 18,
  "Call": 7,
  "wimp": 1,
  "cried": 1,
  "three": 53,
  "Notorious": 4,
  "C.H.O": 4,
  "vulgar": 10,
  "highlights": 1,
  "inspiring": 13,
  "heart-affecting": 1,
  "Vietnamese": 4,
  "relocation": 2,
  "camps": 5,
  "hopes": 6,
  "1975": 4,
  "maturity": 2,
  "displayed": 1,
  "33-year-old": 1,
  "astonishing": 8,
  "inexperience": 1,
  "splendid": 9,
  "young": 81,
  "fullness": 2,
  "ease": 6,
  "live-action": 8,
  "division": 1,
  "releasing": 2,
  "flotsam": 1,
  "occasion": 3,
  "unearthed": 2,
  "facile": 5,
  "terrible": 22,
  "future": 29,
  "cult": 11,
  "classic": 48,
  "destined": 8,
  "risk-takers": 1,
  "crowd": 17,
  "check": 12,
  "form": 30,
  "opinion": 5,
  "artist": 26,
  "Frida": 13,
  "Kahlo": 5,
  "finest": 11,
  "Unfortunately": 17,
  "sandwiched": 1,
  "impossibly": 2,
  "dry": 21,
  "imaginable": 3,
  "Stay": 4,
  "clear": 28,
  "reminding": 4,
  "yourself": 22,
  "helluva": 2,
  "Working": 3,
  "Elliott": 1,
  "Rohmer": 9,
  "fashions": 1,
  "delicate": 17,
  "articulate": 5,
  "relationship": 25,
  "study": 55,
  "favored": 3,
  "enticing": 4,
  "When": 45,
  "counts": 3,
  "Bloody": 4,
  "Sunday": 4,
  "connects": 1,
  "visceral": 13,
  "language": 11,
  "matters": 14,
  "although": 14,
  "supply": 5,
  "complications": 9,
  "calls": 4,
  "double-crosses": 1,
  "Ranging": 1,
  "shattering": 2,
  "featuring": 11,
  "Personal": 6,
  "Velocity": 6,
  "gathers": 1,
  "momentum": 8,
  "complain": 2,
  "repeated": 6,
  "Identity": 5,
  "Recalls": 1,
  "freak-outs": 2,
  "L'Avventura": 1,
  "Repulsion": 1,
  "Only": 11,
  "Spike": 5,
  "Lee": 16,
  "Brown": 17,
  "congeals": 1,
  "pieces": 19,
  "saga": 10,
  "falling": 6,
  "spine": 3,
  "tingle": 1,
  "revelation": 7,
  "laugh": 37,
  "Story": 14,
  "Barbershop": 11,
  "examples": 3,
  "artful": 6,
  "Large": 2,
  "Format": 1,
  "filmmaking": 48,
  "anytime": 1,
  "soon": 14,
  "Well-written": 1,
  "nicely": 12,
  "scored": 4,
  "levels": 14,
  "openly": 2,
  "questioning": 3,
  "mores": 5,
  "ensnaring": 1,
  "pull": 11,
  "X": 19,
  "cheesy": 11,
  "hoary": 3,
  "macabre": 5,
  "self-deprecating": 6,
  "flawed": 22,
  "indicates": 3,
  "talent": 37,
  "generations": 3,
  "test": 11,
  "restrained": 6,
  "sounds": 18,
  "sick": 12,
  "twisted": 11,
  "miracle": 7,
  "Disturbing": 2,
  "eye-opening": 1,
  "tour": 11,
  "Beijing": 4,
  "rebellion": 4,
  "retreat": 2,
  "oblivion": 1,
  "examined": 1,
  "photo": 1,
  "below": 7,
  "gloss": 4,
  "Villeneuve": 3,
  "beating": 2,
  "fondness": 2,
  "Kathryn": 2,
  "Bigelow": 5,
  "sugar-coating": 1,
  "lightness": 4,
  "unrelentingly": 3,
  "unpleasant": 15,
  "menace": 8,
  "squalor": 1,
  "Fisher": 10,
  "bared": 1,
  "confronted": 1,
  "shortcomings": 6,
  "code-talk": 1,
  "fly": 11,
  "super": 3,
  "out-stealth": 1,
  "agent": 6,
  "Super": 7,
  "Spy": 24,
  "avoids": 8,
  "emotions": 29,
  "cuddly": 2,
  "1999": 2,
  "visually": 26,
  "funnier": 16,
  "madcap": 3,
  "pleasures": 16,
  "Troopers": 6,
  "register": 3,
  "strongly": 6,
  "anybody": 6,
  "retains": 4,
  "spot": 10,
  "precollegiate": 1,
  "Sandler": 20,
  "liberated": 1,
  "constraints": 3,
  "depths": 7,
  "distant": 5,
  "sterile": 1,
  "compulsively": 4,
  "watchable": 24,
  "sordid": 6,
  "Hogan": 1,
  "Heroes": 1,
  "star": 53,
  "Bob": 5,
  "Crane": 5,
  "assault": 3,
  "Reno": 12,
  "immense": 3,
  "during": 30,
  "unforgettably": 2,
  "uncertain": 6,
  "predictably": 10,
  "heartwarming": 11,
  "suffused": 1,
  "Sound": 2,
  "trumpets": 1,
  "Desperately": 2,
  "Seeking": 1,
  "Susan": 6,
  "Madonna": 13,
  "suck": 7,
  "J.K.": 3,
  "Rowling": 4,
  "phenomenal": 5,
  "sellers": 1,
  "second": 31,
  "go-round": 1,
  "possesses": 4,
  "pleasing": 8,
  "headlong": 1,
  "thrust": 3,
  "likably": 2,
  "delinquent": 2,
  "inexorably": 2,
  "seven": 6,
  "day": 35,
  "timeframe": 2,
  "increasingly": 13,
  "Maguire": 3,
  "Peter\\/Spider-Man": 1,
  "cozy": 2,
  "ingratiating": 3,
  "challenging": 16,
  "runs": 22,
  "equal": 8,
  "innocence": 11,
  "wisdom": 6,
  "grown": 4,
  "myths": 1,
  "tales": 10,
  "spun": 2,
  "afresh": 1,
  "Rarely": 11,
  "along": 52,
  "exuberant": 2,
  "Monsoon": 5,
  "scarcely": 3,
  "subtitles": 4,
  "colorful": 20,
  "farce": 17,
  "Quite": 3,
  "type": 12,
  "infuriatingly": 2,
  "posturing": 4,
  "evident": 4,
  "deliver": 20,
  "arouse": 1,
  "further": 16,
  "unknowing": 1,
  "boisterous": 3,
  "cruel": 10,
  "fate": 11,
  "hundreds": 2,
  "thousands": 7,
  "qualify": 6,
  "tragedy": 31,
  "crazy": 15,
  "guys": 25,
  "therapeutic": 2,
  "irresistible": 7,
  "grand": 15,
  "denying": 9,
  "physically": 3,
  "integrity": 8,
  "Few": 5,
  "resolute": 1,
  "nakedness": 1,
  "clueless": 3,
  "fiercely": 5,
  "volatile": 7,
  "shaky": 4,
  "memorable": 34,
  "one-liners": 4,
  "Secretary": 7,
  "stays": 12,
  "positions": 1,
  "delights": 6,
  "hindsight": 3,
  "mull": 3,
  "every": 127,
  "average": 19,
  "higher": 7,
  "Mary": 5,
  "byzantine": 1,
  "stimulates": 1,
  "functions": 3,
  "libido": 2,
  "sensitive": 23,
  "expertly": 7,
  "broad": 14,
  "tears": 12,
  "mischievous": 1,
  "catch": 9,
  "guard": 1,
  "Does": 20,
  "warm": 27,
  "invitation": 3,
  "unfamiliar": 5,
  "illuminates": 2,
  "larger": 8,
  "implications": 3,
  "sink": 8,
  "unobtrusively": 1,
  "Almost": 9,
  "stand": 25,
  "realized": 11,
  "observation": 7,
  "mood": 31,
  "intent": 7,
  "rich": 32,
  "suspenseful": 12,
  "moral": 30,
  "stellar": 3,
  "Al": 2,
  "Pacino": 8,
  "audacity": 5,
  "casting": 24,
  "sheer": 13,
  "insanity": 6,
  "version": 51,
  "predecessor": 16,
  "plentiful": 1,
  "summer": 41,
  "used": 26,
  "geared": 4,
  "grownups": 3,
  "tried": 7,
  "fail": 9,
  "explode": 4,
  "manic": 4,
  "Too": 44,
  "exploit": 7,
  "manipulate": 1,
  "saturation": 1,
  "bombing": 2,
  "Reggio": 10,
  "leaves": 35,
  "task": 8,
  "divining": 1,
  "confirmation": 1,
  "object": 5,
  "description": 4,
  "unelected": 1,
  "suspected": 3,
  "W.": 1,
  "Bush": 1,
  "incurious": 1,
  "uncharismatic": 1,
  "overgrown": 1,
  "frat": 4,
  "boy": 24,
  "streak": 3,
  "mile": 7,
  "wide": 7,
  "whiplash": 1,
  "glad": 2,
  "went": 11,
  "Sure": 3,
  "lighthearted": 3,
  "embraces": 5,
  "time-honored": 1,
  "bowel-curdling": 1,
  "heart-stopping": 1,
  "recipe": 5,
  "terror": 6,
  "Daughter": 3,
  "Danang": 3,
  "unmentioned": 1,
  "victims": 11,
  "Zhang": 10,
  "Yimou": 2,
  "lie": 8,
  "dishonesty": 2,
